//1: Объявите переменную «ПростоеЧисло» и присвойте ей значение «57» (тип «Число»)
ПростоеЧисло = 57;

//2: Объявите переменную «НачалоГода» и присвойте ей значение «01.01.2020 00:00:00» (Тип «Дата»)
НачалоГода = '20200101';

//3: Добавьте к переменной «НачалоГода» 8 часов и результат сохраните в переменной «НачалоДня» 
НачалоГода = НачалоГода + 3600*8;

//4: Объявите переменную «КраткоеНазваниеОрганизации» и присвойте ей значение «Яркие краски» (тип «Строка»)
КраткоеНазваниеОрганизации = "Яркие краски";

//5: Объявите переменную «ПолноеНазваниеОрганизации» и присвойте ей значение «ООО «Яркие краски»» (тип «Строка», название организации – в двойных кавычках)
ПолноеНазваниеОрганизации = "ООО ""Яркие краски""";
Сообщить(ПолноеНазваниеОрганизации);

//6: Объявите переменную «ВисокосныйГод» и присвойте ей значение «Истина» (тип «Булево»)
ВисокосныйГод = ИСТИНА;

//7: К чему приведет выполнение программного кода, описанного ниже? 
//Перепишите программный код так, чтобы при его выполнении не 
//возникало ошибки (подсказка: используйте условный оператор) 
Делимое = 15;
Делитель = 0;
Если Делитель <> 0 Тогда
	Частное = Делимое/Делитель;
	Сообщить(Частное);
КонецЕсли;

//8: Конкатенация строк с учетом преобразования типов 
//Объявите 3 переменные «Сотрудник», «ДатаРождения», «Оклад» и 
//присвойте им следующие значения соответственно: «Иванов» (тип «Строка»), 
//«01.02.1989» (тип «Дата») и «1250» (тип «Число»). 
//Используя эти переменные, необходимо сформировать строку с 
//данными сотрудника в переменной «Результат» в следующем формате: 
//«01.02.1989, Иванов, 1250 руб.»

Сотрудник = "Иванов";
ДатаРождения = '19890201';
Оклад = 1250;

Результат = "" + Формат(ДатаРождения, "ДЛФ = Д") + ", " + Сотрудник + ", " + Оклад + " руб";
Сообщить(Результат);

//9: Какое сообщение увидит пользователь в результате выполнения данного программного кода?
Дата1 = "01.09.2020";
Дата2 = Дата1 + 12;
Сообщить(Дата2);

//10: Какое сообщение увидит пользователь в результате выполнения данного программного кода?
Дата1 = '20200901';
Дата2 = Дата1 + 12;
Сообщить(Дата2);

//11: Какое сообщение увидит пользователь в результате выполнения данного программного кода?
ТабельныйНомер = 280;
Оклад = 400;
ПроцентПремии = 14;
РазмерПремии = Оклад * Процентпремии / 100;
//Сообщить(ТабельныйНомер + " - премия = " + РазмерПремии); //Ошибка в преобразованиитипов, нельзя складывать число со строкой

//12: Количество дней между датами 
//Объявите переменную «НачалоМесяца» и присвойте ей значение начала 
//текущего месяца (тип «Дата»). Объявите переменную «КонецМесяца» и 
//присвойте ей значение окончания текущего месяца (Тип «Дата»). Вычислите 
//количество дней между началом и концом месяца и поместите результат в 
//переменную «КоличествоДней»
НачалоМесяца = НачалоМесяца(ТекущаяДата());
КонецМесяца = КонецМесяца(ТекущаяДата());
КоличествоДней = (КонецМесяца - КонецДня(НачалоМесяца))/86400 + 1;
Сообщить(КоличествоДней);

//13: Количество дней с начала года 
//Напишите программный код, который вычислит количество дней 
//начиная с начала текущего года до текущей даты.

НачалоДня = НачалоДня(ТекущаяДата());
НачалоГода = НачалоГода(НачалоДня);
КоличествоДней = (НачалоДня - НачалоГода)/86400 + 1;
Сообщить(КоличествоДней);