// Найти ошибки и написать в чем они заключаются 
// Исправить ошибки и написать каждый фрагмент без ошибок


// 1. Ошибка в имени переменной (имя переменной не должно начинаться с цифры)
Перем КодВалюты;
Перем ПервоеСентября;
Перем _Организация;

Процедура ЗаписьСуммыВПеременную(Число1, Число2, Переменная)
	Переменная = Число1 + Число2;
КонецПроцедуры

Функция СуммаЧисел(Число1, Число2);
	Результат = Число1 + Число2;
	Возврат Результат;
КонецФункции;


// 2. Нет точки с запятой после цикла, нет проверки на тип
КодВалюты = 840;
Если ТипЗнч(КодВалюты) = Тип("Число") Тогда
	Валюта = "USD";
	Сообщить(Валюта);
КонецЕсли;


// 3. Бесконечный цикл
Текдата = '20250218';
КонецМесяца = '20250228';

Пока ТекДата <= КонецМесяца Цикл
	Сообщить(ТекДата);
	ТекДата = ТекДата + 86400;
КонецЦикла;


// 4. Пропущено "= 1" после счетчика
СуммаЧисел = 0;
Для Счетчик = 1 По 200 Цикл
	СуммаЧисел = СуммаЧисел + Счетчик;
КонецЦикла;


// 5. ВтороеЧисло должно быть типом число: 15.5;
// Ошибка преобразования типов (нужно начать сообщение с пустой строки)
ПервоеЧисло = 12;
ВтороеЧисло = 15.5;
Сообщить(ПервоеЧисло + ВтороеЧисло);
РазницаЧисел = ВтороеЧисло - ПервоеЧисло;
ТекстСообщения = "" + ВтороеЧисло + " - " + ПервоеЧисло + " = " + РазницаЧисел;
Сообщить(ТекстСообщения);


//6 Пропущено "Тогда" после каждого ИначеЕсли
НомерМесяца = 4;

Если НомерМесяца = 1 Тогда
	МесяцСтрокой =  "январь";
ИначеЕсли НомерМесяца = 2 Тогда
	МесяцСтрокой = "февраль";
ИначеЕсли НомерМесяца = 3 Тогда
	МесяцСтрокой = "март";
ИначеЕсли НомерМесяца = 4 Тогда
	МесяцСтрокой = "апрель";
ИначеЕсли НомерМесяца = 5 Тогда
	МесяцСтрокой = "май";
ИначеЕсли НомерМесяца = 6 Тогда
	МесяцСтрокой = "июнь";
ИначеЕсли НомерМесяца = 7 Тогда
	МесяцСтрокой = "июль";
ИначеЕсли НомерМесяца = 8 Тогда
	МесяцСтрокой = "август";
ИначеЕсли НомерМесяца = 9 Тогда
	МесяцСтрокой = "сентябрь";
ИначеЕсли НомерМесяца = 10 Тогда
	МесяцСтрокой = "октябрь";
ИначеЕсли НомерМесяца = 11 Тогда
	МесяцСтрокой = "ноябрь";
ИначеЕсли НомерМесяца = 12 Тогда
	МесяцСтрокой = "декабрь";
КонецЕсли;

Сообщить(МесяцСтрокой);

//7 Лишняя строка
//рассчитаем сумму чисел от 1 до 100
СуммаЧиселДо100 = 0;
Для ТекЧисло = 1 по 100 Цикл
	СуммаЧиселДо100 = СуммаЧиселДо100 + ТекЧисло;
КонецЦикла;
Сообщить(СуммаЧиселДо100);

//8 Процедура не может возвращать значение, нужно использовать функцию
Сумма = 0;
Число1 = 5;
Число2 = 6;
ЗаписьСуммыВПеременную(Число1, Число2, Сумма);
Сообщить(Сумма);

//9 Ошибок нет
Сумма = СуммаЧисел(Число1, 58);
Сообщить(Сумма);
