//2. Среди трех чисел найти среднее
Функция ПолучитьСреднееЗначение(Число1, Число2, Число3)
	
	Минимальное = Мин(Число1, Число2, Число3);
	Максимальное = Макс(Число1, Число2, Число3);
	Среднее = "Числа должны быть разными, невозможносно найти среднее из них";
	
	Если (Минимальное < Число1) И (Число1 < Максимальное) Тогда
		Среднее = Число1;
	ИначеЕсли (Минимальное < Число2) И (Число2 < Максимальное) Тогда
		Среднее = Число2;
	ИначеЕсли (Минимальное < Число3) И (Число3 < Максимальное) Тогда
		Среднее = Число3;
	КонецЕсли;
	
	Возврат Среднее;
	
КонецФункции

//3. Проверка делимости одного числа на другое
Процедура ПроверкаДелимости(Число1, Число2)
	
	Если Число2 <> 0 Тогда
		
		Если Число1%Число2 = 0 Тогда
			Частное = Число1/Число2;
			Сообщить("Число " + Число1 + " делится на " + Число2 + " без остатка, " + Число1 + "/" + Число2 + "=" + Частное + ", Остаток = 0");
		Иначе
			Остаток = Число1%Число2;
			Частное = (Число1 - Остаток)/Число2;
			Сообщить("Число " + Число1 + " делится на " + Число2 + " с остатком, " + Число1 + "/" + Число2 + "=" + Частное + " (Остаток = " + Остаток+ ")");
		КонецЕсли;
		
	Иначе
		Сообщить("Дедить на 0 нельзя");
	КонецЕсли;
КонецПроцедуры

//5. Опишите функцию ПолучитьМесяцСтрокой(), которая будет по числовому номеру месяца возвращать строковое представление.
Функция ПолучитьМесяцСтрокой(НомерМесяца)
	
	Если НомерМесяца = 1 Тогда
		НазваниеМесяца = "Январь";
	ИначеЕсли НомерМесяца = 2 Тогда
		НазваниеМесяца = "Февраль";
	ИначеЕсли НомерМесяца = 3 Тогда
		НазваниеМесяца = "Март";
	ИначеЕсли НомерМесяца = 4 Тогда
		НазваниеМесяца = "Апрель";
	ИначеЕсли НомерМесяца = 5 Тогда
		НазваниеМесяца = "Май";
	ИначеЕсли НомерМесяца = 6 Тогда
		НазваниеМесяца = "Июнь";
	ИначеЕсли НомерМесяца = 7 Тогда
		НазваниеМесяца = "Июль";
	ИначеЕсли НомерМесяца = 8 Тогда
		НазваниеМесяца = "Август";
	ИначеЕсли НомерМесяца = 9 Тогда
		НазваниеМесяца = "Сентябрь";
	ИначеЕсли НомерМесяца = 10 Тогда
		НазваниеМесяца = "Октябрь";
	ИначеЕсли НомерМесяца = 11 Тогда
		НазваниеМесяца = "Ноябрь";
	ИначеЕсли НомерМесяца = 12 Тогда
		НазваниеМесяца = "Декабрь"
	КонецЕсли;
	
	Возврат НазваниеМесяца;
	
КонецФункции

//6. Номер месяца по названию
Функция ПолучитьНомерМеcяца(МесяцСтрокой)
	
	Если МесяцСтрокой = "Январь" Тогда
		МесяцЧислом = 1;
	ИначеЕсли МесяцСтрокой = "Февраль" Тогда
		МесяцЧислом = 2;
	ИначеЕсли МесяцСтрокой = "Март" Тогда
		МесяцЧислом = 3;
	ИначеЕсли МесяцСтрокой = "Апрель" Тогда
		МесяцЧислом = 4;
	ИначеЕсли МесяцСтрокой = "Май" Тогда
		МесяцЧислом = 5;
	ИначеЕсли МесяцСтрокой = "Июнь" Тогда
		МесяцЧислом = 6;
	ИначеЕсли МесяцСтрокой = "Июль" Тогда
		МесяцЧислом = 7;
	ИначеЕсли МесяцСтрокой = "Август" Тогда
		МесяцЧислом = 8;
	ИначеЕсли МесяцСтрокой = "Сентябрь" Тогда
		МесяцЧислом = 9;
	ИначеЕсли МесяцСтрокой = "Октябрь" Тогда
		МесяцЧислом = 10;
	ИначеЕсли МесяцСтрокой = "Ноябрь" Тогда
		МесяцЧислом = 11;
	ИначеЕсли МесяцСтрокой = "Декабрь" Тогда
		МесяцЧислом = 12;
	КонецЕсли;
	
	Возврат МесяцЧислом;
	
КонецФункции

//1. Какое сообщение увидит пользователь на экране в результате работы приведенного выше программного кода. ***Да***
Условие1 = Истина;
Условие2 = Ложь;
Условие3 = Ложь;
Условие4 = Истина;
Условие5 = Истина;
Условие6 = Истина;
Результат = (НЕ (Условие1 ИЛИ Условие2) И Условие3) ИЛИ Условие4 И Условие5 ИЛИ НЕ Условие6;
Сообщить(Результат);

Среднее = ПолучитьСреднееЗначение(23626,-7777,71);
Сообщить(Среднее);

ПроверкаДелимости(-7,5);

//4. Перепишите программный код, используя краткую форму условного оператора
Счетчик =15;
Значение = 5;
Количество = 2;
Значение = ?(Счетчик = 1, 0, Количество * Счетчик);
Сообщить(Значение);


Месяц = ПолучитьМесяцСтрокой(7);
Сообщить(Месяц);

НомерМесяца = ПолучитьНомерМеcяца("Май");
Сообщить(НомерМесяца);