//1 Числа от 1 до 100 в порядке убывания 
Переменная = 100;

Для Счетчик = 1 По 100 Цикл
	Сообщить(Переменная);
	Переменная = Переменная - 1;
КонецЦикла;

//2 Возведение числа в степень
ЧислоА = 5;
Степень = -3;
НачальноеЧисло = ЧислоА;

Если Степень >= 1 Тогда
	
	Для Счетчик = 2 По Степень Цикл
		ЧислоА = ЧислоА * НачальноеЧисло;
	КонецЦикла;
	
ИначеЕсли Степень < 0 Тогда
	
	Для Счетчик = Степень По 0 Цикл
		ЧислоА = ЧислоА / НачальноеЧисло;
	КонецЦикла;
	
Иначе
	ЧислоА = 1;
КонецЕсли;

Сообщить(ЧислоА);

//3 Вывод таблицы умножения 
ПервыйМножитель = 1;

Для ВсеЧисла = 1 по 9 Цикл
	
	ВторойМножитель = 1;
	Произведение = 1;
	
	Для Счетчик = 1 По 9 Цикл
		
		
		Сообщить("" + ПервыйМножитель + "*" + ВторойМножитель + " = " + Произведение);
		ВторойМножитель = ВторойМножитель + 1;
		Произведение = ПервыйМножитель * ВторойМножитель;
	КонецЦикла;
	
	ПервыйМножитель = ПервыйМножитель + 1;
	
КонецЦикла;

//4 Четные числа от 1 до 100 
Значение = 100;

Для Счетчик = 1 По 100 Цикл
	
	Если Значение%2 = 0 Тогда
		Сообщить(Значение);
	КонецЕсли;
	
	Значение = Значение - 1;
КонецЦикла;
