//1 Представить дробное число в виде суммы строкой

//***********************************
//Вариант через форматную строку
ВведенноеЧисло = 127.45;

ЦелаяЧасть = Цел(ВведенноеЧисло);
ДробнаяЧасть = ВведенноеЧисло - ЦелаяЧасть;
ЦелаяЧасть = Формат(ЦелаяЧасть, "ЧФ='Ч руб. '");
ДробнаяЧасть = Формат(ДробнаяЧасть, "ЧС=-2; ЧФ='Ч коп.'");

Сообщить(ЦелаяЧасть + ДробнаяЧасть);

//Простой вариант
ВведенноеЧисло = 357.59;

ЦелаяЧасть = Цел(ВведенноеЧисло);
ДробнаяЧасть = (ВведенноеЧисло - ЦелаяЧасть)*100;

Сообщить("" + ЦелаяЧасть + " руб. " + ДробнаяЧасть + " коп.");
//***********************************



//2 Нестандартный алгоритм округления
ЧислоДоОкругления = 127.50;

Если ЧислоДоОкругления < 100 Тогда
	ОкругленнаяЦена = Окр(ЧислоДоОкругления, 0);
Иначе
	ОкругленнаяЦена = Окр(ЧислоДоОкругления, 0, 0);
КонецЕсли;

Сообщить(ОкругленнаяЦена);



//3 Число прописью
ИсходноеЧисло = 235.02;
ЧислоКопеек = ((ИсходноеЧисло - Цел(ИсходноеЧисло))*100);

Если ЧислоКопеек < 11 Тогда
	ФормСтрока = "Л = ru_RU; НД = Истина; ДП = ИСТИНА"; //Сто двадцать рублей семь копеек
ИначеЕсли ЧислоКопеек >= 11 И ЧислоКопеек <= 99 Тогда
	ФормСтрока = "Л = ru_RU; НД = Истина; ДП = ЛОЖЬ"; //Сто двадцать рублей 25 копеек
КонецЕсли;

ПарПредмета="рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2";
ПрописьЧисла = ЧислоПрописью(ИсходноеЧисло, ФормСтрока, ПарПредмета);
Сообщить(ПрописьЧисла);



//4 Получение дробной части числа
ИсходноеЧисло = -5.27;
ДробнаяЧасть = (ИсходноеЧисло - Цел(ИсходноеЧисло));
Сообщить(ДробнаяЧасть);