Функция СтрокаВДату(ДатаСтрокой)
	
	ДатаСтрокой = СтрЗаменить(ДатаСтрокой, ".", "");
	ДатаСтрокой = СтрЗаменить(ДатаСтрокой, "/", "");
	ДатаСтрокой = СтрЗаменить(ДатаСтрокой, "-", "");
	
	День	 = Лев(ДатаСтрокой, 2);
	Месяц	 = Сред(ДатаСтрокой, 3, 2);
	Год		 = Прав(ДатаСтрокой, 4);
	
	ДатаСтрокой = Год + Месяц + День;
	ДатаСтрокой = Дата(ДатаСтрокой);
	
	Возврат ДатаСтрокой;
КонецФункции

функция ДополнитьСтроку(Значение, ДлинаСтроки, Символ, Режим)
	
	ЧислоНедостающихСимволов = ДлинаСтроки - СтрДлина(Значение);
	
	Если Режим = "Справа" Тогда
		Для Счетчик = 1 по ЧислоНедостающихСимволов Цикл
			Значение = Значение + Символ;
		КонецЦикла;
	ИначеЕсли Режим = "Слева" Тогда
		Для Счетчик = 1 по ЧислоНедостающихСимволов Цикл
			Значение = Символ + Значение;
		КонецЦикла;
	КонецЕсли;
	
	Сообщить(Значение);
	
КонецФункции


ДатаРождения = СтрокаВДату("01-01-2000");
Сообщить(ДатаРождения);

Строка = "12345";
ДополнитьСтроку(Строка, 7, "/", "Слева");