//Удаление элементов массива
//Обход с конца
МассивЧисел = Новый Массив;

МассивЧисел.Добавить(10);
МассивЧисел.Добавить(8);
МассивЧисел.Добавить(4);
МассивЧисел.Добавить(15);
МассивЧисел.Добавить(2);
МассивЧисел.Добавить(4);


КоличествоИндексов = МассивЧисел.Количество();
МаксимальныйИндекс = МассивЧисел.ВГраница();

Для Счетчик = 0 По (КоличествоИндексов - 1) Цикл
	
	Если МассивЧисел.Получить(МаксимальныйИндекс) < 10 Тогда
		МассивЧисел.Удалить(МаксимальныйИндекс);
	КонецЕсли;
	
	МаксимальныйИндекс = МаксимальныйИндекс - 1;
КонецЦикла;

Для Каждого ТекЭлемент из МассивЧисел Цикл
	Сообщить(ТекЭлемент);
КонецЦикла;