//Проверить, является ли строка числом (состоит только из цифр, возможно наличие одной точки между цифр)
//Пример
//"124" - строка является числом
//"45к2" - строка не является числом

Функция СтрокаЯвляетсяЧислом(СтрокаДляПроверки)
	
	Если (СтрНайти(СтрокаДляПроверки, ".",,, 2))>0 Тогда
		Возврат "Строка не являетя числом (содержит более одной точки)";
	КонецЕсли;
		
	КоличествоСимволов = СтрДлина(СтрокаДляПроверки);
	Для Счетчик = 1 по КоличествоСимволов Цикл
		ТекСимвол = Сред(СтрокаДляПроверки, Счетчик, 1);
		Если ТекСимвол <> "0" И ТекСимвол <> "1" И ТекСимвол <> "2" И ТекСимвол <> "3" И ТекСимвол <> "4" И ТекСимвол <> "5" И ТекСимвол <> "6" И ТекСимвол <> "7" И ТекСимвол <> "8" И ТекСимвол <> "9" И ТекСимвол <> "." Тогда
			Возврат "Строка не является числом (найден символ " + ТекСимвол + " )";
			Прервать
		КонецЕсли;
	КонецЦикла;
	
	Возврат "Строка является числом";
	
КонецФункции

Сообщить(СтрокаЯвляетсяЧислом("1")); //Да
Сообщить(СтрокаЯвляетсяЧислом("123")); //Да
Сообщить(СтрокаЯвляетсяЧислом("134.567")); //Да
Сообщить(СтрокаЯвляетсяЧислом("123а")); //Нет
Сообщить(СтрокаЯвляетсяЧислом("12,3")); //Нет
