//Все методы работы с массивом
МассивСтрок = Новый Массив;

//метод добавить()
МассивСтрок.Добавить("Первый");
МассивСтрок.Добавить("Второй");
МассивСтрок.Добавить("Третий");

//метод ВГраница()
НаибольшийИндекс = МассивСтрок.ВГраница();

Для Индекс = 0 по МассивСтрок.ВГраница() Цикл
	МассивСтрок[Индекс] = МассивСтрок[Индекс] + " день";
КонецЦикла;

//метод Вставить()
МассивСтрок.Вставить(2, "Второй день повторно");
МассивСтрок.Вставить(8);

//метод Количество()
КоличествоЭлементов = МассивСтрок.Количество();
Сообщить(КоличествоЭлементов);

//метод Найти()
НайденноеЗначение = МассивСтрок.Найти("Второй день");
Сообщить(НайденноеЗначение);

//метод Получить() или массив[]
ЗначениеЭлемента = МассивСтрок[3];
Сообщить(ЗначениеЭлемента);

ЗначениеДругогоЭлемента = МассивСтрок.Получить(2);
Сообщить(ЗначениеДругогоЭлемента);

//метод Удалить()
МассивСтрок.Удалить(2);

//метод Установить()
МассивСтрок.Установить(3, "Четвертый день");
МассивСтрок[4] = "Пятый день";

//метод Очистить()
МассивСтрок.Очистить();
