&НаКлиенте
Процедура РаботаСМассивом(Команда)
	
	//Как создать массив
	МассивСтудентов = Новый Массив;
	
	//Как добавить в массив элементы
	МассивСтудентов.Добавить("Тетерев");
	МассивСтудентов.Добавить("Бакланов");
	МассивСтудентов.Добавить("Соколов");
	
	//Как получить количество элементов в массиве
	КоличествоЭлементовМассива = МассивСтудентов.Количество();
	
	//Как найти индекс значение в массиве
	ИндексСоколова = МассивСтудентов.Найти("Соколов");
	
	//Как получить значение массива(2 способа)
	СоколовПервымМетодом = МассивСтудентов[2];
	СоколовВторымМетодом = МассивСтудентов.Получить(2);
	
	//Обход всех элементов массива
	Для каждого элемент из МассивСтудентов Цикл
		Сообщить(элемент);
	КонецЦикла;
	
	//Как удалить элемент массива (удалить элементы массива, которые меньше 10)
	МассивЧисел = Новый Массив;
	
	МассивЧисел.Добавить(10);
	МассивЧисел.Добавить(8);
	МассивЧисел.Добавить(4);
	МассивЧисел.Добавить(15);
	
	МассивКУдалению = Новый Массив;
	
	Для каждого элемент из МассивЧисел Цикл
		Если элемент < 10 Тогда
			МассивКУдалению.Добавить(элемент);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого элемент из МассивКУдалению Цикл
		Индекс = МассивЧисел.Найти(элемент);
		МассивЧисел.Удалить(Индекс);
	КонецЦикла;
	
	//Удалить элементы массива, которые меньше 10 (обходом массива с конца)
	МассивЧиселДляУдаленияСКонца = Новый Массив;
	
	МассивЧиселДляУдаленияСКонца.Добавить(10);
	МассивЧиселДляУдаленияСКонца.Добавить(8);
	МассивЧиселДляУдаленияСКонца.Добавить(4);
	МассивЧиселДляУдаленияСКонца.Добавить(15);
	
	МассивБольшихЧисел = УдалитьЧислаМассиваМеньшеДесяти(МассивЧиселДляУдаленияСКонца);
	//Как вставить значение
	МассивЧисел.Вставить(0,25);
	
	//Как устанвить значение массива по индексу (два способа)
	МассивЧисел.Установить(1,12);
	МассивЧисел[2] = 30;
	
	//Как очистить массив
	МассивЧисел.Очистить();
	
	МассивРазмеров = Новый Массив;
	МассивРазмеров.Добавить("Первый");
	МассивРазмеров.Вставить(3, "Третий индекс");
	
КонецПроцедуры

&НаКлиенте
Процедура РаботаСоСтруктурой(Команда)
	
	//Как создать структуру (3 способа)
	Структура1 = Новый Структура;
	
	Структура2 = Новый Структура("ФИО, НомерСтуденческого, Курс");
	
	Структура3 = Новый Структура("ФИО, НомерСтуденческого, Курс, Успеваемость" , "Тетерев Николай Николаевич", 214003 , 3, "Отлично");
	
	//Как вставить элемент в структуру
	Структура2.Вставить("Курс", 3);
	Структура2.Вставить("Группа", 4);
	
	//Как получить количество элементов в структуре
	КоличествоСтрокСтруктуры = Структура2.Количество();
	
	//Как найти значение в структуре
	НомерГруппы = Неопределено;
	НомерГруппыСуществует = Структура2.Свойство("Группа", НомерГруппы);
	
	//Как получить значение структуры (3 способа)
	НомерСтуденческого = Структура3["НомерСтуденческого"];
	ФИО = Структура3.ФИО;
	
	УспеваемостьНиколая = Неопределено;
	Успеваемость = Структура3.Свойство("Успеваемость",УспеваемостьНиколая);
	
	//Обход всех элементов структуры
	МассивСтруктур = Новый Массив;
	МассивСтруктур.Добавить(Структура1);
	МассивСтруктур.Добавить(Структура2);
	МассивСтруктур.Добавить(Структура3);
	
	Для каждого Структура из МассивСтруктур Цикл
		
		Для каждого ЭлементСтруктуры из Структура Цикл
			
			Сообщить(ЭлементСтруктуры.Ключ + ": " + ЭлементСтруктуры.Значение);
			
		КонецЦикла;
		
	КонецЦикла;
	
	//Как удалить элемент структуры
	Структура2.Удалить("Успеваемость");
	
	//Как очистить структуру
	Структура2.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура РаботаССоответствием(Команда)
	
	//Как создать соответствие
	СоответствиеПраздников = Новый Соответствие;
	
	//Как вставить элемент в соответствие
	СоответствиеПраздников.Вставить('20250101', "Новый год");
	СоответствиеПраздников.Вставить('20250308', "Восьмое марта");
	СоответствиеПраздников.Вставить('20250901', "Первое сентября");
	
	//Как получить количество элементов в соответствии
	КоличествоПраздников = СоответствиеПраздников.Количество();
	
	//Как найти значениев соответствии
	ВосьмоеМарта = СоответствиеПраздников.Получить('20250308');
	
	//Как получить значение соответствия (2 способа)
	
	//1й способ
	Сообщить(СоответствиеПраздников['20250901']);
	
	//2й способ
	Для каждого ЭлементСоответствия из СоответствиеПраздников Цикл
		
		Если ЭлементСоответствия.Ключ = '20250308' Тогда
			Сообщить(ЭлементСоответствия.Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	//Обход всех элементов соответствия
	Для каждого ЭлементСоответствия из СоответствиеПраздников Цикл
		
		Сообщить("" + ЭлементСоответствия.Ключ + " " + ЭлементСоответствия.Значение);
		
	КонецЦикла;
	
	//Как удалить элемент соответствия
	СоответствиеПраздников.Удалить('20250901');
	
	//Как очистить соответствие
	СоответствиеПраздников.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура РаботаСоСпискомЗначений(Команда)
	
	//Как создать список значений
	СписокЗначений = Новый СписокЗначений;
	
	//Как добавить элементы в список значений
	СписокЗначений.Добавить("Пн", "Понедельник", Истина, БиблиотекаКартинок.ГеографическаяСхема);
	СписокЗначений.Добавить("Вт", "Вторник", Ложь, БиблиотекаКартинок.ГеографическаяСхема);
	СписокЗначений.Добавить("Ср", "Среда", Истина, БиблиотекаКартинок.ГеографическаяСхема);
	СписокЗначений.Добавить("Чт", "Четверг", Ложь, БиблиотекаКартинок.ГеографическаяСхема);
	СписокЗначений.Добавить("Пт", "Пятница", Истина, БиблиотекаКартинок.ГеографическаяСхема);
	СписокЗначений.Добавить("Сб", "Суббота", Истина, БиблиотекаКартинок.ГеографическаяСхема);
	СписокЗначений.Добавить("Вс", "Воскресение", Истина, БиблиотекаКартинок.ГеографическаяСхема);
	СписокЗначений.Вставить(3, "ВторСред", "ВтораяСреда", Истина, БиблиотекаКартинок.БизнесПроцесс);
	
	//Как получить количество элементов в списке значений
	Сообщить(СписокЗначений.Количество());
	
	//Как найти значение в списке значений
	Вторник = СписокЗначений.НайтиПоЗначению("Вт");
	Среда = СписокЗначений.НайтиПоИдентификатору(4);
	
	//Как получить значение из списка значений (2 способа)
	Воскресенье = СписокЗначений.Получить(7);
	Суббота = СписокЗначений[6];
	
	//Обход всех элементов списка значений
	Для каждого ЭлементСпискаЗначений Из СписокЗначений Цикл
		Сообщить("" + ЭлементСпискаЗначений.Значение + " " + ЭлементСпискаЗначений.Представление + " " + ЭлементСпискаЗначений.Пометка);
	КонецЦикла;
	
	//Показать список значений пользователю для выбора одного значения
	ВыбранныйЭлемент = СписокЗначений.ВыбратьЭлемент("Дни недели на выбор", СписокЗначений.НайтиПоЗначению("Пт"));
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		Сообщить("Вы выбрали: " + ВыбранныйЭлемент.Представление)
	Иначе
		Сообщить("Вы не выбрали ни один элемент из предложенных...");
	КонецЕсли;
	
	//Показать список значений пользователю для отметки нескольких значений
	ВыбранныеЭлементы = СписокЗначений.ОтметитьЭлементы("Выберите несколько дней недели");
	Для каждого Элемент из СписокЗначений Цикл
		Если Элемент.Пометка = Истина Тогда
			Сообщить ("Выбран: " + Элемент.Значение + " " + Элемент.Представление);
		КонецЕсли
	КонецЦикла;
	
	//Тест остальных методов для соответствий
	СписокЗначенийВМассив = СписокЗначений.ВыгрузитьЗначения();
	
	МассивВсписокЗначений = Новый Массив;
	МассивВСписокзначений.Добавить("Компьютер");
	МассивВСписокзначений.Добавить("Мышь");
	МассивВСписокзначений.Добавить("Клавиатура");
	МассивВСписокзначений.Добавить("Монитор");
	
	СписокЗначений.ЗагрузитьЗначения(МассивВСписокЗначений);
	
	СписокЗначений.ЗаполнитьПометки(Истина);
	
	Для каждого Элемент из СписокЗначений Цикл
	Сообщить(СписокЗначений.Индекс(Элемент));
	КонецЦикла;
	
	СписокЗначений.Сдвинуть(1,1);
	СписокЗначений.Сдвинуть(0,1);
	
	ВторойСписокЗначений = СписокЗначений.Скопировать();
	
	
	ВторойСписокЗначений.Добавить("Пн", 12, Истина, БиблиотекаКартинок.ГеографическаяСхема);
	ВторойСписокЗначений.Добавить("Вт", 7, Ложь, БиблиотекаКартинок.ГеографическаяСхема);
	ВторойСписокЗначений.Добавить("Ср", 2, Истина, БиблиотекаКартинок.ГеографическаяСхема);
	ВторойСписокЗначений.Добавить("Чт", 3, Ложь, БиблиотекаКартинок.ГеографическаяСхема);
	ВторойСписокЗначений.Добавить("Пт", 74, Истина, БиблиотекаКартинок.ГеографическаяСхема);
	ВторойСписокЗначений.Добавить("Сб", 5, Истина, БиблиотекаКартинок.ГеографическаяСхема);
	ВторойСписокЗначений.Добавить("Вс", 6, Истина, БиблиотекаКартинок.ГеографическаяСхема);
	ВторойСписокЗначений.Вставить(3, "ВторСред", "ВтораяСреда", Истина, БиблиотекаКартинок.БизнесПроцесс);
	
	ВторойСписокЗначений.СортироватьПоПредставлению();
	
	ВторойСписокЗначений.СортироватьПоЗначению();
	ВторойСписокЗначений.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
	
	ЭлементСпискаЗначений = ВторойСписокЗначений.Получить(5);
	
	//Как удалить элемент списказначений
	ВторойСписокЗначений.Удалить(ЭлементСпискаЗначений);
	
	//Как очистить список значений
	ВторойСписокЗначений.Очистить();
	
КонецПроцедуры

Функция УдалитьЧислаМассиваМеньшеДесяти (МассивЧисел)
	
	Если МассивЧисел.ВГраница() >= 0 Тогда
		
		Индекс = МассивЧисел.ВГраница();
		
		Для счетчик = 1 По МассивЧисел.Количество() Цикл
			
			Если МассивЧисел[Индекс] < 10 Тогда
				МассивЧисел.Удалить(Индекс);
			КонецЕсли;
			
			Индекс = Индекс -1;
		КонецЦикла;
		
		Возврат МассивЧисел
		
	Иначе
		Сообщить("Массив чисел пустой");
	КонецЕсли;
	
КонецФункции