&НаКлиенте
Процедура РаботаСМассивом(Команда)
	
	//Как создать массив
	МассивСтудентов = Новый Массив;
	
	//Как добавить в массив элементы
	МассивСтудентов.Добавить("Тетерев");
	МассивСтудентов.Добавить("Бакланов");
	МассивСтудентов.Добавить("Соколов");
	
	//Как получить количество элементов в массиве
	КоличествоЭлементовМассива = МассивСтудентов.Количество();
	
	//Как найти индекс значение в массиве
	ИндексСоколова = МассивСтудентов.Найти("Соколов");
	
	//Как получить значение массива(2 способа)
	СоколовПервымМетодом = МассивСтудентов[2];
	СоколовВторымМетодом = МассивСтудентов.Получить(2);
	
	//Обход всех элементов массива
	Для каждого элемент из МассивСтудентов Цикл
		Сообщить(элемент);
	КонецЦикла;
	
	//Как удалить элемент массива (удалить элементы массива, которые меньше 10)
	МассивЧисел = Новый Массив;
	
	МассивЧисел.Добавить(10);
	МассивЧисел.Добавить(8);
	МассивЧисел.Добавить(4);
	МассивЧисел.Добавить(15);
	
	МассивКУдалению = Новый Массив;
	
	Для каждого элемент из МассивЧисел Цикл
		Если элемент < 10 Тогда
			МассивКУдалению.Добавить(элемент);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого элемент из МассивКУдалению Цикл
		Индекс = МассивЧисел.Найти(элемент);
		МассивЧисел.Удалить(Индекс);
	КонецЦикла;
	
	//Удалить элементы массива, которые меньше 10 (обходом массива с конца)
	МассивЧиселДляУдаленияСКонца = Новый Массив;
	
	МассивЧиселДляУдаленияСКонца.Добавить(10);
	МассивЧиселДляУдаленияСКонца.Добавить(8);
	МассивЧиселДляУдаленияСКонца.Добавить(4);
	МассивЧиселДляУдаленияСКонца.Добавить(15);
	
	МассивБольшихЧисел = УдалитьЧислаМассиваМеньшеДесяти(МассивЧиселДляУдаленияСКонца);
	//Как вставить значение
	МассивЧисел.Вставить(0,25);
	
	//Как устанвить значение массива по индексу (два способа)
	МассивЧисел.Установить(1,12);
	МассивЧисел[2] = 30;
	
	//Как очистить массив
	МассивЧисел.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура РаботаСоСтруктурой(Команда)
	
	//Как создать структуру (3 способа)
	Структура1 = Новый Структура;
	
	Структура2 = Новый Структура("ФИО, НомерСтуденческого, Курс");
	
	Структура3 = Новый Структура("ФИО, НомерСтуденческого, Курс, Успеваемость" , "Тетерев Николай Николаевич", 214003 , 3, "Отлично");
	
	//Как вставить элемент в структуру
	Структура2.Вставить("Курс", 3);
	Структура2.Вставить("Группа", 4);
	
	//Как получить количество элементов в структуре
	КоличествоСтрокСтруктуры = Структура2.Количество();
	
	//Как найти значение в структуре
	НомерГруппы = Неопределено;
	НомерГруппыСуществует = Структура2.Свойство("Группа", НомерГруппы);
	
	//Как получить значение структуры (3 способа)
	НомерСтуденческого = Структура3["НомерСтуденческого"];
	ФИО = Структура3.ФИО;
	
	УспеваемостьНиколая = Неопределено;
	Успеваемость = Структура3.Свойство("Успеваемость",УспеваемостьНиколая);
	
	//Обход всех элементов структуры
	МассивСтруктур = Новый Массив;
	МассивСтруктур.Добавить(Структура1);
	МассивСтруктур.Добавить(Структура2);
	МассивСтруктур.Добавить(Структура3);
	
	Для каждого Структура из МассивСтруктур Цикл
		
		Для каждого ЭлементСтруктуры из Структура Цикл
			
			Сообщить(ЭлементСтруктуры.Ключ + ": " + ЭлементСтруктуры.Значение);
			
		КонецЦикла;
		
	КонецЦикла;
	
	//Как удалить элемент структуры
	Структура2.Удалить("Успеваемость");
	
	//Как очистить структуру
	Структура2.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура РаботаССоответствием(Команда)
	
КонецПроцедуры

&НаКлиенте
Процедура РаботаСоСпискомЗначений(Команда)
	
КонецПроцедуры

Функция УдалитьЧислаМассиваМеньшеДесяти (МассивЧисел)
	
	Если МассивЧисел.ВГраница() >= 0 Тогда
		
		Индекс = МассивЧисел.ВГраница();
		
		Для счетчик = 1 По МассивЧисел.Количество() Цикл
			
			Если МассивЧисел[Индекс] < 10 Тогда
				МассивЧисел.Удалить(Индекс);
			КонецЕсли;
			
			Индекс = Индекс -1;
		КонецЦикла;
		
		Возврат МассивЧисел
		
	Иначе
		Сообщить("Массив чисел пустой");
	КонецЕсли;
	
КонецФункции
