//Задачи находятся в 4.1 Задачи
Функция ЯвляетсяЛиСтрокаЧислом(СтрокаДляПроверки)
	
	Если (СтрНайти(СтрокаДляПроверки, ".",,, 2))>0 Тогда
		Возврат "Строка не являетя числом (содержит более одной точки)";
	КонецЕсли;
	
	КоличествоСимволов = СтрДлина(СтрокаДляПроверки);
	Для Счетчик = 1 по КоличествоСимволов Цикл
		ТекСимвол = Сред(СтрокаДляПроверки, Счетчик, 1);
		Если ТекСимвол <> "0" И ТекСимвол <> "1" И ТекСимвол <> "2" И ТекСимвол <> "3" И ТекСимвол <> "4" И ТекСимвол <> "5" И ТекСимвол <> "6" И ТекСимвол <> "7" И ТекСимвол <> "8" И ТекСимвол <> "9" И ТекСимвол <> "." Тогда
			Возврат "Строка не является числом (найден символ " + ТекСимвол + " )";
			Прервать
		КонецЕсли;
	КонецЦикла;
	
	Возврат "Строка является числом";
	
КонецФункции

Функция УбратьВсеЦифрыИзСтроки(Строка)
	
	МассивЧисел = Новый Массив;
	МассивЧисел.Добавить("  ");
	МассивЧисел.Добавить("1");
	МассивЧисел.Добавить("2");
	МассивЧисел.Добавить("3");
	МассивЧисел.Добавить("4");
	МассивЧисел.Добавить("5");
	МассивЧисел.Добавить("6");
	МассивЧисел.Добавить("7");
	МассивЧисел.Добавить("8");
	МассивЧисел.Добавить("9");
	
	Для Каждого ЭлементМассива из МассивЧисел Цикл
		НоваяСтрока = СтрЗаменить(Строка, ЭлементМассива, "");
		Строка = НоваяСтрока;
	КонецЦикла;
	
	Возврат Строка
	
КонецФункции

Функция УдалитьПовторяющиесяСимволы(Строка)
	
	СтрокаБезПробелов = СтрЗаменить(Строка, " ", "");
	ПолученнаяСтрока = "";
	
	Для Счетчик = 1 по СтрДлина(СтрокаБезПробелов) Цикл
		ТекСимвол = Сред(СтрокаБезПробелов, Счетчик, 1);
		Если СтрЧислоВхождений(ПолученнаяСтрока, ТекСимвол) < 1 Тогда
			ПолученнаяСтрока = ПолученнаяСтрока + ТекСимвол;
		КонецЕсли
	КонецЦикла;
	
	Возврат ПолученнаяСтрока
	
КонецФункции

Функция КоличествоСловВСтроке(Строка)
	
	КоличествоСловПослеПробела = 0;
	
	Для Счетчик = 1 по (СтрДлина(Строка)-1) Цикл
		
		ТекСимвол = Сред(Строка,Счетчик,1);
		Следсимвол = Сред(Строка,(Счетчик +1),1);
		
		Если ТекСимвол = " " И СледСимвол <> " " Тогда
			КоличествоСловПослеПробела = КоличествоСловПослеПробела + 1;
		КонецЕсли;
	КонецЦикла;
	
	Если Сред(Строка, 1, 1) <> " " Тогда
		ОбщееКоличествоСлов = КоличествоСловПослеПробела + 1;
	Иначе
		ОбщееКоличествоСлов = КоличествоСловПослеПробела;
	КонецЕсли;
	
	Возврат ОбщееКоличествоСлов
	
КонецФункции

Процедура СообщитьРасширениеФайла(ПутьКФайлуСтрокой)
	
	ПозицияТочки = СтрНайти(ПутьКФайлуСтрокой, ".", НаправлениеПоиска.СКонца);
	СимволыСправа = Сред(ПутьКФайлуСтрокой, (ПозицияТочки + 1));
	
	Сообщить("Расширение файла: " + СимволыСправа);
	
КонецПроцедуры

Сообщить(ЯвляетсяЛиСтрокаЧислом("1")); //Да
Сообщить(ЯвляетсяЛиСтрокаЧислом("123")); //Да
Сообщить(ЯвляетсяЛиСтрокаЧислом("134.567")); //Да
Сообщить(ЯвляетсяЛиСтрокаЧислом("123а")); //Нет
Сообщить(ЯвляетсяЛиСтрокаЧислом("12,3")); //Нет

Строка = "11122П24ри214в  е  35т Пе  2т123456789я";
Сообщить(УбратьВсеЦифрыИзСтроки(Строка));

ИсходнаяСтрока = "abc cde de        eeefwaaasfaga";
Сообщить(УдалитьПовторяющиесяСимволы(ИсходнаяСтрока));

Строка = " красный белый    желтый синий  я привет    белый а";
Сообщить(КоличествоСловВСтроке(Строка));

ПутьКФайлу = "E:\User\Выписки\20210916.xml";
СообщитьРасширениеФайла(ПутьКФайлу);