//Задания находятся в папке задания 4.2
Функция РазностьДат(Дата1, Дата2)
	
	РазностьДат = (Дата2 - Дата1)/86400;
	
	Возврат РазностьДат
	
КонецФункции

Процедура СообщитьКоличествоВыхРабДней(Дата1, Дата2)
	
	КолвоВых = 0;
	КолвоРаб = 0;
	
	Пока Дата1 <= Дата2 Цикл
		
		Если ДеньНедели(Дата1) = 6 ИЛИ ДеньНедели(Дата1) = 7 Тогда
			КолвоВых = КолвоВых + 1;
		ИначеЕсли ДеньНедели(Дата1) <> 6 И ДеньНедели(Дата1) <> 7 Тогда
			КолвоРаб = КолвоРаб + 1;
		КонецЕсли;
		
		Дата1 = Дата1 + 86400;
		
	КонецЦикла;
	
	Сообщить("Количество рабочих дней: " + КолвоРаб + "
	|Количество выходных дней: " + КолвоВых);
	
КонецПроцедуры

ДевятоеМая = '20250509';
ФорматированнаяДата = Формат(ДевятоеМая, "ДЛФ=DD");
Сообщить(ФорматированнаяДата);

Дата1 = '20200312';
Дата2 = '20200327';

РазностьДат = РазностьДат('20200312','20200327');
Сообщить("Результат: " + РазностьДат + " дней");

Дата1 = '20250428';
Дата2 = '20250526';

СообщитьКоличествоВыхРабДней(Дата1, Дата2);

ТекДата = ТекущаяДата();
НачалоТекГода = НачалоГода(ТекДата);
СентябрьТекГода = ДобавитьМесяц(НачалоТекГода, 8);
ФорматированнаяДата = Формат(СентябрьТекГода, "ДФ=yyyy.MM.dd");
Сообщить(ФорматированнаяДата);