Функция СуммаСтрокойВЧисло (Строка)
	
	ПолученнаяСтрока = "";
	Массив = СтрРазделить(Строка, ".", Ложь);
	
	Для каждого Элемент из  Массив цикл
		
		Число = Лев(Элемент, (СтрДлина(Элемент) - 4));
		ПолученнаяСтрока = ПолученнаяСтрока + Число;
		
	КонецЦикла;
	
	ПолученнаяСтрока = СтрЗаменить(ПолученнаяСтрока, " ", ".");
	Число = Число(ПолученнаяСтрока);
	
	Возврат Число
	
КонецФункции

Функция ДатаСтрокойВДату (ДатаСтрокой)
	
	МассивДат = СтрРазделить(ДатаСтрокой, " ", Ложь);
	
	День = МассивДат[0];
	МесяцСтрокой = МассивДат[1];
	ГодСтрокой = МассивДат[2];
	
	Если МесяцСтрокой = "января" Тогда
		Месяц = "01";
	ИначеЕсли МесяцСтрокой = "февраля" Тогда
		Месяц = "02";
	ИначеЕсли МесяцСтрокой = "марта" Тогда
		Месяц = "03";
	ИначеЕсли МесяцСтрокой = "апреля" Тогда
		Месяц = "04";
	ИначеЕсли МесяцСтрокой = "мая" Тогда
		Месяц = "05";
	ИначеЕсли МесяцСтрокой = "июня" Тогда
		Месяц = "06";
	ИначеЕсли МесяцСтрокой = "июля" Тогда
		Месяц = "07";
	ИначеЕсли МесяцСтрокой = "августа" Тогда
		Месяц = "08";
	ИначеЕсли  МесяцСтрокой = "сентября" Тогда
		Месяц = "09";
	ИначеЕсли МесяцСтрокой = "октября" Тогда
		Месяц = "10";
	ИначеЕсли МесяцСтрокой = "ноября" Тогда
		Месяц = "11";
	ИначеЕсли МесяцСтрокой = "декабря" Тогда
		Месяц = "12";
	КонецЕсли;
	
	Год = Лев(ГодСтрокой, (СтрДлина(ГодСтрокой) -2));
	
	ДатаСтрокой = Год + Месяц + День;
	Дата = Дата(ДатаСтрокой);
	Дата = Формат(Дата, "ДФ=dd.MM.yyyy");
	
	Возврат Дата
	
КонецФункции

Строка = "127 руб. 25 коп.";
Число = СуммаСтрокойВЧисло(Строка);
Сообщить(Число);

ДатаСтрокой = "24 июня 2025г.";
Дата = ДатаСтрокойВДату(ДатаСтрокой);
Сообщить(Дата);

А = 2 + "2"; // 4
Б = "2" + 2; // 22
// В = 2 + "А"; //Пример ошибки преобразования типов
Дата = '20250518' + 10; // 18.05.2025 0:00:10

ТекущаяДата = '20200324';
КоличествоДнейДоКонцаМесяца = 10 - "2";
КонецМесяца = ТекущаяДата + КоличествоДнейДоКонцаМесяца;
// Сообщить("Конец месяца = " + КонецМесяца); // Конец месяца = 24.03.2020 0:00:08

// // Пример ошибки преобразования типов
//
// А = 14;
// Б = 15;
// Результат = (А + Б)*2;
// Сообщить(А + "+" + Б + "=" + Результат);