//Задания находятся в папке Задания/4.4 Задания.pdf

&НаКлиенте
Процедура РаботаСМассивом(Команда)
	//1. Среднее арифметическое
	МассивЧисел = Новый Массив;
	
	Для Счетчик = 1 по 50 Цикл
		МассивЧисел.Добавить(Счетчик);
	КонецЦикла;
	
	Сумма = 0;
	
	Для каждого Значение из МассивЧисел Цикл
		Сумма = Сумма + Значение;
	КонецЦикла;
	
	СреднееАрифметическое = Сумма/(МассивЧисел.Количество());
	
	Сообщить("Среднее арифметическое чисел 1+2+3+4+ ... +49+50 = " + СреднееАрифметическое);
	
	//2. Минимальный и максимальный элемент массива 
	МассивМинМакс = Новый Массив;
	
	МассивМинМакс.Добавить(17);
	МассивМинМакс.Добавить(15);
	МассивМинМакс.Добавить(6);
	МассивМинМакс.Добавить(7);
	МассивМинМакс.Добавить(99);
	МассивМинМакс.Добавить(52);
	МассивМинМакс.Добавить(14);
	
	Мин = МассивМинМакс[0];
	Макс = МассивМинМакс[0];
	
	Для каждого Элемент из МассивМинМакс Цикл
		
		Если Мин > Элемент Тогда
			Мин = Элемент;
		ИначеЕсли Макс < Элемент Тогда
			Макс = Элемент;
		КонецЕсли
		
	КонецЦикла;
	
	Сообщить("Минимальный: " + Мин + "; Максимальный: " + Макс);
	
	//3. Удалить дубли из массива
	МассивСДублями = Новый Массив;
	
	МассивСДублями.Добавить(14);
	МассивСДублями.Добавить(15);
	МассивСДублями.Добавить(15);
	МассивСДублями.Добавить(14);
	МассивСДублями.Добавить(2);
	МассивСДублями.Добавить(18);
	МассивСДублями.Добавить(19);
	МассивСДублями.Добавить(20);
	МассивСДублями.Добавить(2);
	МассивСДублями.Добавить(2);
	
	МассивБезДублей = Новый Массив;
	
	Для каждого Элемент из МассивСДублями Цикл
		
		Если МассивБезДублей.Найти(Элемент) = Неопределено Тогда
			МассивБезДублей.Добавить(Элемент);
		КонецЕсли;
		
	КонецЦикла;
	
	МассивСДублями = МассивБезДублей;
	
	//4. Удаление элементов массива по условию
	МассивДат = Новый Массив;
	
	ТекДата = ТекущаяДата();
	НачМесяца = НачалоМесяца(ТекДата);
	КонМесяца = КонецМесяца(ТекДата);
	
	Пока НачМесяца <= КонМесяца Цикл
		
		МассивДат.Добавить(НачМесяца);
		НачМесяца = НачМесяца + 86400;
		
	КонецЦикла;
	
	МассивВыхНаУдаление = Новый Массив;
	
	Для Каждого День из МассивДат Цикл;
		
		Если ДеньНедели(День) = 6 ИЛИ ДеньНедели(День) = 7 Тогда
			МассивВыхНаУдаление.Добавить(День);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Выходной Из МассивВыхНаУдаление Цикл
		Индекс = МассивДат.Найти(Выходной);
		МассивДат.Удалить(Индекс);
	КонецЦикла;
	
	Для Каждого РабДень из МассивДат Цикл
		Сообщить(РабДень);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РаботаСоСтруктурой(Команда)
	
	//5. Массив товаров (Вложенные коллекции)
	МассивТоваров = Новый Массив;
	
	Товар1 = Новый Структура;
	Товар1.Вставить("Артикул", 184601023);
	Товар1.Вставить("Наименование", "Смартфон Xiaomi Redmi 9 3/32GB, зеленый");
	Товар1.Вставить("Штрихкод", 978020137962);
	Товар1.Вставить("Цена", 418.12);
	
	МассивТоваров.Добавить(Товар1);
	
	Товар2 = Новый Структура;
	Товар2.Вставить("Артикул", 215543732);
	Товар2.Вставить("Наименование", "Смартфон Samsung Galaxy A12");
	Товар2.Вставить("Штрихкод", 478020147962);
	Товар2.Вставить("Цена", 352.55);
	
	МассивТоваров.Добавить(Товар2);
	
	Товар3 = Новый Структура;
	Товар3.Вставить("Артикул", 254514022);
	Товар3.Вставить("Наименование", "Смартфон Poco X3 Pro 8");
	Товар3.Вставить("Штрихкод", 448021147962);
	Товар3.Вставить("Цена", 734.07);
	
	МассивТоваров.Добавить(Товар3);
	
	Если МассивТоваров.Получить(0).Цена <> Неопределено Тогда
		МинЦена = МассивТоваров.Получить(0).Цена;
	Иначе
		Сообщить("Массив товаров пустой")
	КонецЕсли;
	
	Для Каждого Товар из МассивТоваров Цикл
		
		Если Товар.Цена < МинЦена Тогда
			МинЦена = Товар.Цена;
		КонецЕсли;
		
	КонецЦикла;
	
	Сообщить("Мин цена: " + МинЦена);
	
	Для Каждого Товар из МассивТоваров Цикл
		
		Если Товар.Цена = МинЦена Тогда
			Руб = Цел(Товар.Цена);
			Коп = (Товар.Цена - Руб)*100;
			Сообщить("Самый дешевый товар: " + Товар.Наименование + ", цена: " + Руб + " руб. " + Коп + " коп.");
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РаботаССоответствием(Команда)
	
	//6. Даты с днями недели 
	ДатыЗаМесяц = Новый Соответствие;
	
	ТекДата = ТекущаяДата();
	НачМесяца = НачалоМесяца(ТекДата);
	КонМесяца = КонецМесяца(ТекДата);
	
	ДеньНедели = Новый Массив;
	ДеньНедели.Добавить("понедельник");
	ДеньНедели.Добавить("вторник");
	ДеньНедели.Добавить("среда");
	ДеньНедели.Добавить("четверг");
	ДеньНедели.Добавить("пятница");
	ДеньНедели.Добавить("суббота");
	ДеньНедели.Добавить("воскресенье");
	
	Пока КонМесяца >= НачМесяца Цикл
		
		НазваниеДняСтрокой = ДеньНедели.Получить(ДеньНедели(КонМесяца) - 1);
		ДатыЗаМесяц.Вставить(КонМесяца, НазваниеДняСтрокой);
		КонМесяца = КонМесяца - 86400;
		
	КонецЦикла;
	
	Для каждого День Из ДатыЗаМесяц Цикл
		
		ДатаДат = Формат(День.Ключ, "ДФ=dd.MM.yyyy");
		ДатаСтр = ТРег(День.Значение);
		Сообщить("" + ДатаДат + ": " + ДатаСтр);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РаботаСоСпискомЗначений(Команда)
	//7. Выбор вида документа 
	ВидыДокументов = Новый СписокЗначений;
	
	ВидыДокументов.Добавить("СчетНаОплату", "Счет на оплату",, БиблиотекаКартинок.Документ);
	ВидыДокументов.Добавить("ЗаказКлиенту", "Заказ клиенту",, БиблиотекаКартинок.Документ);
	ВидыДокументов.Добавить("ЗаказПоставщику", "Заказ поставщику",, БиблиотекаКартинок.Документ);
	ВидыДокументов.Добавить("ПоступлениеТоваров", "Поступление товаров",, БиблиотекаКартинок.Документ);
	
	ВыбранныйВидДокумента = ВидыДокументов.ВыбратьЭлемент("Выберите тип документа");
	
	Если ВыбранныйВидДокумента <> Неопределено Тогда
		
		Сообщить("Вы выбрали документ: " + ВыбранныйВидДокумента.Представление);
	Иначе
		 Сообщить("Вы не выбрали ни один документ");
	КонецЕсли;
	
	//Задание 7 Доп:
	ВыбранныеВидыДокументов = ВидыДокументов.ОтметитьЭлементы("Выберите документы");
	
	
	СтрВыбДок = "";
	Для каждого ВидДокумента Из ВидыДокументов Цикл
		
		Если ВидДокумента.Пометка = Истина Тогда
			СтрВыбДок = СтрВыбДок + ВидДокумента.Представление + "; ";
		КонецЕсли;
		
	КонецЦикла;
	
	Если СтрВыбДок = "" Тогда
		Сообщить("Вы не выбрали ни один документ");
	ИначеЕсли СтрвыбДок <> "" Тогда
		Сообщить("Вы выбрали: " + СтрВыбДок);
	КонецЕсли;
	
КонецПроцедуры