&НаКлиенте
Процедура РаботаСТаблицейЗначений(Команда)
	
	РаботаСТаблицейЗначенийНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура РаботаСТаблицейЗначенийНаСервере()
	
	//Как создать таблицу значений
	ТаблицаТовары = Новый ТаблицаЗначений;
	
	//Как добавить колонки в таблицу значений
	ТаблицаТовары.Колонки.Добавить("Номенклатура");
	ТаблицаТовары.Колонки.Добавить("Склад");
	ТаблицаТовары.Колонки.Добавить("ВНаличии");
	ТаблицаТовары.Колонки.Добавить("ВРезерве");
	ТаблицаТовары.Колонки.Добавить("Остаток");
	
	//Как загрузить данные в таблицу значений из массива
	МассивСДанными = Новый Массив;
	ЗаполнитьМассивСДанными(МассивСДанными);
	
	Количество = МассивСДанными[0].Количество();
	
	Для Счетчик = 1 По Количество Цикл
		ТаблицаТовары.Добавить();
	КонецЦикла;
	
	ТаблицаТовары.ЗагрузитьКолонку(МассивСДанными[0], "Номенклатура");
	ТаблицаТовары.ЗагрузитьКолонку(МассивСДанными[1], "Склад");
	ТаблицаТовары.ЗагрузитьКолонку(МассивСДанными[2], "ВНаличии");
	ТаблицаТовары.ЗагрузитьКолонку(МассивСДанными[3], "ВРезерве");
	ТаблицаТовары.ЗагрузитьКолонку(МассивСДанными[4], "Остаток");
	
	//Как добавить элементы (строки) в таблицу значений
	НоваяСтрока = ТаблицаТовары.Добавить();
	НоваяСтрока.Номенклатура = "Яблоки";
	НоваяСтрока.Склад = "Основной склад";
	НоваяСтрока.ВНаличии = "7";
	НоваяСтрока.ВРезерве = "3";
	НоваяСтрока.Остаток = "10";
	
	//Как получить количество элементов в таблице значений
	Количество = ТаблицаТовары.Количество();
	
	//Как найти один элемент в таблице значений
	Яблоки = ТаблицаТовары.Найти("Яблоки", "Номенклатура");
	Сообщить("Элемент " + Яблоки.Номенклатура + " найден");
	
	//Как найти все элементы таблицы значений, которые удовлетворяют условию поиска
	ПараметрыОтбора = Новый Структура;
	Параметрыотбора.Вставить("Номенклатура", "Капуста белокачанная");
	МассивНайденныхСтрок = ТаблицаТовары.НайтиСтроки(ПараметрыОтбора);
	
	Если МассивНайденныхСтрок.Количество() > 0 тогда
		
		//нашли строки
		Для каждого Строка из МассивНайденныхСтрок Цикл
			Сообщить(Строка.Склад);
		КонецЦикла;
		
	ИначеЕсли МассивНайденныхСтрок.Количество() = 0 тогда
		
		//не нашли строки
		Сообщить("Строки не найдены");
		
	КонецЕсли;
	
	//Поиск по комбинации Номенклатура + Склад
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Номенклатура", "Капуста белокачанная");
	ПараметрыОтбора.Вставить("Склад", "Торговый зал");
	
	Строки = ТаблицаТовары.НайтиСтроки(Параметрыотбора);
	
	//*Задание структуры по ключам и значениям
	Структура = Новый Структура("Номенклатура, Склад", "Капуста белокачанная", "Магазин ""Продукты""");
	Строки = Таблицатовары.НайтиСтроки(Структура);
	
	Если Строки.Количество() > 0 Тогда
		Сообщить("Склад: " + Строки[0].Склад + ", Остаток: " + Строки[0].Остаток);
	Иначе
		Сообщить("Строки не найдены");
	КонецЕсли;
	
	//Как создать копию таблицы значений (с данными)
	КопияТаблицы = ТаблицаТовары.Скопировать();
	
	//Как сделать копию части таблицы
	МассивСтрокДляКопирования = Новый Массив;
	МассивСтрокДляКопирования.Добавить(ТаблицаТовары[2]);
	МассивСтрокДляКопирования.Добавить(ТаблицаТовары[3]);
	МассивСтрокДляКопирования.Добавить(ТаблицаТовары[4]);
	
	ПараметрыОтбора = Новый Структура;
	Параметрыотбора.Вставить("Номенклатура", "Вентилятор JIPONIC, напольный");
	
		//Первый вариант синтаксиса
		КопияТаблицы = ТаблицаТовары.Скопировать(МассивСтрокДляКопирования, "Номенклатура, Остаток");
		
		//Второй ваиант синтаксиса
		КопияТаблицы = ТаблицаТовары.Скопировать(ПараметрыОтбора, "Номенклатура, Склад");
		
	//Как скопировать несколько колонок
	КопияТаблицы = ТаблицаТовары.Скопировать(, "Номенклатура, Склад");
		
	//Как создать копию таблицы значений (без данных)
	ПустаяТаблица = ТаблицаТовары.СкопироватьКолонки();
	
	//Как удалить элемент таблицы значений
		//По объекту
	Если Таблицатовары[6] <> Неопределено Тогда
	СтрокаТаблицыЗначений = ТаблицаТовары[6];
	КонецЕсли;
	
	ТаблицаТовары.Удалить(СтрокаТаблицыЗначений);
		//По индексу
	Если ТаблицаТовары[10] <> Неопределено Тогда
	ТаблицаТовары.Удалить(10);
	КонецЕсли;
	
	//Как очистить таблицу значений
	//ТаблицаТовары.Очистить();
	
	//Как выполнить сортировку в таблице значений
	ТаблицаТовары.Сортировать("ВНаличии Убыв");
	
	Альфа = Новый СравнениеЗначений;
	ТаблицаТовары.Сортировать("ВНаличии Возр", Альфа);
	
	//Как получить итог по колонке числового типа
	КоличествоТоваровВНаличии = ТаблицаТовары.Итог("ВНаличии");
	
	//Обходвсех элементов (строк) таблицы значений
	Для каждого Строка из ТаблицаТовары цикл
		Сообщить(Строка.Номенклатура + " " + Строка.Остаток);
	КонецЦикла;
	
	//Свертка таблицы
	КопияТаблицы = Таблицатовары.Скопировать();
	КопияТаблицы.Свернуть("Номенклатура", "ВНаличии");
	
	//Обход всех "ячеек" таблицы значений
	Для каждого Строка из ТаблицаТовары Цикл
		
		Для каждого Колонка из ТаблицаТовары.Колонки Цикл
			Сообщить(Строка[Колонка.Имя]);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМассивСДанными(МассивСДанными)
	
	МассивНоменклатура = Новый Массив;
	МассивСклад = Новый Массив;
	МассивВНаличии = Новый Массив;
	МассивВРезерве = Новый Массив;
	МассивОстаток = Новый Массив;
	
	МассивСДанными.Добавить(МассивНоменклатура);
	МассивСДанными.Добавить(МассивСклад);
	МассивСДанными.Добавить(МассивВНаличии);
	МассивСДанными.Добавить(МассивВРезерве);
	МассивСДанными.Добавить(МассивОстаток);
	
	МассивНоменклатура.Добавить("Слива""Овация"", не годен");
	МассивНоменклатура.Добавить("Вентилятор JIPONIC, напольный");
	МассивНоменклатура.Добавить("Капуста белокачанная");
	МассивНоменклатура.Добавить("Капуста белокачанная");
	МассивНоменклатура.Добавить("Капуста белокачанная");
	МассивНоменклатура.Добавить("Хлеб ""Водар""");
	МассивНоменклатура.Добавить(" Хлеб ""Балтийский"" нарезной");
	МассивНоменклатура.Добавить("Кондиционер для белья");
	МассивНоменклатура.Добавить("Порошок стиральный");
	МассивНоменклатура.Добавить(" Стол кухонный ""Стандарт Плюс""");
	МассивНоменклатура.Добавить(" Стул ""Премьер""");
	
	МассивСклад.Добавить("Торговый зал");
	МассивСклад.Добавить("Магазин ""Бытовая техника""");
	МассивСклад.Добавить("Магазин ""Продукты""");
	МассивСклад.Добавить("Торговый зал");
	МассивСклад.Добавить("Оптовый склад");
	МассивСклад.Добавить("Магазин ""Продукты""");
	МассивСклад.Добавить("Магазин ""Продукты""");
	МассивСклад.Добавить("Оптовый склад");
	МассивСклад.Добавить("Оптовый склад");
	МассивСклад.Добавить("Мебельный склад");
	МассивСклад.Добавить("Мебельный склад");
	
	МассивВНаличии.Добавить(2);
	МассивВНаличии.Добавить(3);
	МассивВНаличии.Добавить(2000);
	МассивВНаличии.Добавить(949.14);
	МассивВНаличии.Добавить(980.1);
	МассивВНаличии.Добавить(20);
	МассивВНаличии.Добавить(20);
	МассивВНаличии.Добавить(4);
	МассивВНаличии.Добавить(16);
	МассивВНаличии.Добавить(10);
	МассивВНаличии.Добавить(7);
	
	МассивВРезерве.Добавить(0);
	МассивВРезерве.Добавить(0);
	МассивВРезерве.Добавить(30);
	МассивВРезерве.Добавить(49.78);
	МассивВРезерве.Добавить(0);
	МассивВРезерве.Добавить(0);
	МассивВРезерве.Добавить(0);
	МассивВРезерве.Добавить(0);
	МассивВРезерве.Добавить(0);
	МассивВРезерве.Добавить(0);
	МассивВРезерве.Добавить(0);
	
	МассивОстаток.Добавить(2);
	МассивОстаток.Добавить(3);
	МассивОстаток.Добавить(2030);
	МассивОстаток.Добавить(998.92);
	МассивОстаток.Добавить(980.1);
	МассивОстаток.Добавить(20);
	МассивОстаток.Добавить(20);
	МассивОстаток.Добавить(4);
	МассивОстаток.Добавить(16);
	МассивОстаток.Добавить(10);
	МассивОстаток.Добавить(7);
	
КонецПроцедуры

