&НаКлиенте
Процедура РаботаСТаблицейЗначений(Команда)
	
	РаботаСТаблицейЗначенийНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура РаботаСТаблицейЗначенийНаСервере()
	
	//Как создать таблицу значений
	ТаблицаТовары = Новый ТаблицаЗначений;
	
	//Как добавить колонки в таблицу значений
	ТаблицаТовары.Колонки.Добавить("Номенклатура");
	ТаблицаТовары.Колонки.Добавить("Склад");
	ТаблицаТовары.Колонки.Добавить("Вналичии");
	ТаблицаТовары.Колонки.Добавить("Врезерве");
	ТаблицаТовары.Колонки.Добавить("Остаток");
	
	//Как добавить элементы (строки) в таблицу значений
	ЗаполнитьТаблицуЗначений(ТаблицаТовары);
	
	//Как получить количество элементов в таблице значений
	КоличествоСтрок = ТаблицаТовары.Количество();
	
	//Как найти один элемент в таблице значений
	Стол = ТаблицаТовары.Найти("Стол кухонный ""Стандарт Плюс""");
	
	//Как найти все элементы таблицы значений, которые удовлетворяют условию поиска
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Номенклатура", "Капуста белокачанная");
	Капуста = ТаблицаТовары.НайтиСтроки(ПараметрыОтбора);
	
	Если Капуста <> Неопределено Тогда
		Для каждого СтрокаТаблицы из Капуста Цикл
		Сообщить(СтрокаТаблицы.Склад + ": " + СтрокаТаблицы.Остаток);
		КонецЦикла;
	Иначе
		Сообщить("Товар (Капуста белокачанная) не найден");
	КонецЕсли;
	
	//Поиск по комбинации номенклатуры
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Номенклатура", "Капуста белокачанная");
	ПараметрыОтбора.Вставить("Склад", "Оптовый склад");
	
	КапустаНаОптскладе = ТаблицаТовары.НайтиСтроки(ПараметрыОтбора);
	
	Если КапустаНаОптскладе <> Неопределено Тогда
		Для каждого СтрокаТаблицы из КапустаНаОптскладе Цикл
		Сообщить(СтрокаТаблицы.Склад + ": " + СтрокаТаблицы.Остаток);
		КонецЦикла;
	Иначе
		Сообщить("Товар (Капуста белокачанная) на оптовом складе не найден");
	КонецЕсли;
	
	МассивЧисел = Новый Массив;
	МассивЧисел.Добавить(0);
	МассивЧисел.Добавить(1);
	
	//Как создать копию таблицы значений (с данными)
	ПолнаяКопияТаблицы = ТаблицаТовары.Скопировать();
	КопияТабПоМассивуСтрок = ТаблицаТовары.Скопировать(Капуста);
	КопияТабПоКолонкам = ТаблицаТовары.Скопировать(,"Склад, ВНаличии, ВРезерве, Остаток");
	
	//Как создать копию таблицы значений (без данных)
	//Как удалить элемент таблицы значений
	//Как очистить таблицу значений
	//Как выполнить сортировку в таблице значений
	//Как получить итог по колонке числового типа
	//Обход всех элементов (строк) таблицы значений
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуЗначений(ТаблицаЗначений)
	
	НоваяСтрока = ТаблицаЗначений.Добавить();
	НоваяСтрока.Номенклатура = "Слива ""Овация"", Не годен";
	НоваяСтрока.Склад = "Торговый зал";
	НоваяСтрока.ВНаличии = 2;
	НоваяСтрока.ВРезерве = 0;
	НоваяСтрока.Остаток = 2;
	
	НоваяСтрока = ТаблицаЗначений.Добавить();
	НоваяСтрока.Номенклатура = "Вентилятор JIPONIC, напольный";
	НоваяСтрока.Склад = "Магазин ""Бытовая техника""";
	НоваяСтрока.ВНаличии = 3;
	НоваяСтрока.ВРезерве = 0;
	НоваяСтрока.Остаток = 3;
	
	НоваяСтрока = ТаблицаЗначений.Добавить();
	НоваяСтрока.Номенклатура = "Капуста белокачанная";
	НоваяСтрока.Склад = "Магазин ""Продукты""";
	НоваяСтрока.ВНаличии =2000;
	НоваяСтрока.ВРезерве = 30;
	НоваяСтрока.Остаток = 2030;
	
	НоваяСтрока = ТаблицаЗначений.Добавить();
	НоваяСтрока.Номенклатура = "Капуста белокачанная";
	НоваяСтрока.Склад = "Торговый зал";
	НоваяСтрока.ВНаличии = 949.140;
	НоваяСтрока.ВРезерве = 49.78;
	НоваяСтрока.Остаток = 998.920;
	
	НоваяСтрока = ТаблицаЗначений.Добавить();
	НоваяСтрока.Номенклатура = "Капуста белокачанная";
	НоваяСтрока.Склад = "Оптовый склад";
	НоваяСтрока.ВНаличии = 980.100;
	НоваяСтрока.ВРезерве = 0;
	НоваяСтрока.Остаток = 980.100;
	
	НоваяСтрока = ТаблицаЗначений.Добавить();
	НоваяСтрока.Номенклатура = "Хлеб ""Водар""";
	НоваяСтрока.Склад = "Магазин ""Продукты""";
	НоваяСтрока.ВНаличии = 20;
	НоваяСтрока.ВРезерве = 0;
	НоваяСтрока.Остаток = 20;
	
	НоваяСтрока = ТаблицаЗначений.Добавить();
	НоваяСтрока.Номенклатура = "Хлеб ""Балтийский"" нарезной";
	НоваяСтрока.Склад = "Магазин ""Продукты""";
	НоваяСтрока.ВНаличии = 20;
	НоваяСтрока.ВРезерве = 0;
	НоваяСтрока.Остаток = 20;
	
	НоваяСтрока = ТаблицаЗначений.Добавить();
	НоваяСтрока.Номенклатура = "Кондиционер для белья";
	НоваяСтрока.Склад = "Оптовый склад";
	НоваяСтрока.ВНаличии = 4;
	НоваяСтрока.ВРезерве = 0;
	НоваяСтрока.Остаток = 4;
	
	НоваяСтрока = ТаблицаЗначений.Добавить();
	НоваяСтрока.Номенклатура = "Порошок стиральный";
	НоваяСтрока.Склад = "Торговый зал";
	НоваяСтрока.ВНаличии = 16;
	НоваяСтрока.ВРезерве = 0;
	НоваяСтрока.Остаток = 16;
	
	НоваяСтрока = ТаблицаЗначений.Добавить();
	НоваяСтрока.Номенклатура = "Стол кухонный ""Стандарт Плюс""";
	НоваяСтрока.Склад = "Торговый зал";
	НоваяСтрока.ВНаличии = 10;
	НоваяСтрока.ВРезерве = 0;
	НоваяСтрока.Остаток = 10;
	
	НоваяСтрока = ТаблицаЗначений.Добавить();
	НоваяСтрока.Номенклатура = "Стул ""Премьер""";
	НоваяСтрока.Склад = "Торговый зал";
	НоваяСтрока.ВНаличии = 7;
	НоваяСтрока.ВРезерве = 0;
	НоваяСтрока.Остаток = 7;
	
КонецПроцедуры