&НаКлиенте
Процедура РаботаСДеревомЗначений(Команда)
	
	РаботаСДеревомЗначенийНаСервере()
	
КонецПроцедуры

&НаСервере
Процедура РаботаСДеревомЗначенийНаСервере()
	
	//Как создать дерево значений
	ДеревоТоваров = Новый ДеревоЗначений;
	
	//Как добавить колонки в дерево значений
	ДеревоТоваров.Колонки.Добавить("Номенклатура");
	ДеревоТоваров.Колонки.Добавить("Склад");
	ДеревоТоваров.Колонки.Добавить("ВНаличии");
	ДеревоТоваров.Колонки.Добавить("ВРезерве");
	ДеревоТоваров.Колонки.Добавить("Остаток");
	
	//Как добавить элементы (строки) в дерево значений
	
	ЗаполненитьДеревоТоваров(ДеревоТоваров);
	
	//Как получить количество элементов в дереве значений
	КоличествоСтрокУровень1 = ДеревоТоваров.Строки.Количество();
	
	КоличествоСтрокУровень2 = 0;
	
	Для каждого СтрокаУровень2 из ДеревоТоваров.Строки Цикл
		
		КоличествоСтрокУровень2 = КоличествоСтрокУровень2 + СтрокаУровень2.Строки.Количество()
		
	КонецЦикла;
	
	Сообщить("Количество строк 1го уровня: " + КоличествоСтрокУровень1);
	Сообщить("Количество строк 2го уровня: " + КоличествоСтрокУровень2);
	
	//Как найти один элемент в дереве значений
	НайденнаяСтрока = ДеревоТоваров.Строки.Найти("Вентилятор оконный, модель 902", "Номенклатура", Истина);
	
	Если НайденнаяСтрока = Неопределено Тогда
		Сообщить("Строка не найдена");
	Иначе
		Сообщить(НайденнаяСтрока.Остаток);
	КонецЕсли;
	
	//Как найти все элементы дерева значений, которые удовлетворяют условию поиска
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Номенклатура", "Вентилятор JIPONIC, напольный");
	НайденныеСтроки = ДеревоТоваров.Строки.НайтиСтроки(ПараметрыОтбора, Истина);
	
	//Как создать копию дерева значений (с данными)
	КопияДереваЗначений = ДеревоТоваров.Скопировать();
	
	//Как удалить элементы дерева значений
	НайденнаяСтрока = "";
	
	Пока КопияДереваЗначений.Строки.Найти("Вентилятор JIPONIC, напольный", "Номенклатура", Истина) <> Неопределено Цикл
		НайденнаяСтрока = КопияДереваЗначений.Строки.Найти("Вентилятор JIPONIC, напольный", "Номенклатура", Истина);
		
		Если НайденнаяСтрока.Родитель <> Неопределено Тогда
			НайденнаяСтрока.Родитель.Строки.Удалить(НайденнаяСтрока);
		Иначе
			НайденнаяСтрока.Строки.Удалить(НайденнаяСтрока);
		КонецЕсли;
		
	КонецЦикла;
	
	//Как удалить один элемент дерева значений
	НайденнаяСтрока = КопияДереваЗначений.Строки.Найти("Ларек ""Розница""", "Склад");
	
	Если НайденнаяСтрока <> Неопределено Тогда
		
		Если НайденнаяСтрока.Родитель = Неопределено Тогда
			КопияДереваЗначений.Строки.Удалить(НайденнаяСтрока);
		Иначе
			НайденнаяСтрока.Родитель.Строки.Удалить(НайденнаяСтрока);
		КонецЕсли;
		
	КонецЕсли;
	
	//Как очистить дерево значений
	//КопияДереваЗначений.Строки.Очистить();
	
	//Как выполнить сортировку в дереве значений
	ДеревоТоваров.Строки.Сортировать("ВНаличии Убыв", Истина);
	
	//Обход всех элементов дерева значений
	
	//Для каждого СтрокаУровень1 из ДеревоТоваров.Строки Цикл
	//	
	//	Сообщить(СтрокаУровень1.Склад);
	//	
	//	Для каждого СтрокаУровень2 из СтрокаУровень1.Строки Цикл
	//		Сообщить(СтрокаУровень2.Номенклатура);
	//	КонецЦикла;
	//	
	//КонецЦикла;
	
	ОбходДереваРекурсивно(ДеревоТоваров)
	
КонецПроцедуры

&НаСервере
Процедура ОбходДереваРекурсивно(ДеревоТоваров)
	
	Если ДеревоТоваров.Строки.Количество() = 0 Тогда
		Возврат
	КонецЕсли;
	
	Для каждого СтрокаТекУровня из ДеревоТоваров.Строки Цикл
		
		Сообщить("Тек. Уровень: " + СтрокаТекУровня.Уровень() + " " + СтрокаТекУровня.Склад + " " + СтрокаТекУровня.Номенклатура);
		ОбходДереваРекурсивно(СтрокаТекУровня)
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполненитьДеревоТоваров(ДеревоТоваров);
	
	СтрокаПервогоУровня = ДеревоТоваров.Строки.Добавить();
	СтрокаПервогоУровня.Склад = "Арендованный склад Вега-Транс";
	СтрокаПервогоУровня.ВНаличии = 34;
	СтрокаПервогоУровня.ВРезерве = 0;
	СтрокаПервогоУровня.Остаток = 34;
	
	СтрокаВторогоУровня = СтрокаПервогоУровня.Строки.Добавить();
	СтрокаВторогоУровня.Номенклатура = "Ботинки женские демисезонные";
	СтрокаВторогоУровня.ВНаличии = 6;
	СтрокаВторогоУровня.ВРезерве = 0;
	СтрокаВторогоУровня.Остаток = 6;
	
	СтрокаВторогоУровня = СтрокаПервогоУровня.Строки.Добавить();
	СтрокаВторогоУровня.Номенклатура = " Вентилятор BINATONE ALPINE 160вт, напольный, оконный";
	СтрокаВторогоУровня.ВНаличии = 3;
	СтрокаВторогоУровня.ВРезерве = 0;
	СтрокаВторогоУровня.Остаток = 3;
	
	СтрокаВторогоУровня = СтрокаПервогоУровня.Строки.Добавить();
	СтрокаВторогоУровня.Номенклатура = "Вентилятор оконный, модель 902";
	СтрокаВторогоУровня.ВНаличии = 1;
	СтрокаВторогоУровня.ВРезерве = 0;
	СтрокаВторогоУровня.Остаток = 1;
	
	СтрокаВторогоУровня = СтрокаПервогоУровня.Строки.Добавить();
	СтрокаВторогоУровня.Номенклатура = "Вентилятор JIPONIC, напольный";
	СтрокаВторогоУровня.ВНаличии = 1;
	СтрокаВторогоУровня.ВРезерве = 0;
	СтрокаВторогоУровня.Остаток = 1;
	
	СтрокаВторогоУровня = СтрокаПервогоУровня.Строки.Добавить();
	СтрокаВторогоУровня.Номенклатура = "S-545454 Samsung двухкамерный, авторазморозка РОССИЯ";
	СтрокаВторогоУровня.ВНаличии = 18;
	СтрокаВторогоУровня.ВРезерве = 0;
	СтрокаВторогоУровня.Остаток = 18;
	
	СтрокаВторогоУровня = СтрокаПервогоУровня.Строки.Добавить();
	СтрокаВторогоУровня.Номенклатура = "S-3243234 Samsungоднокамерный, авторазморозкаРОССИЯ";
	СтрокаВторогоУровня.ВНаличии = 3;
	СтрокаВторогоУровня.ВРезерве = 0;
	СтрокаВторогоУровня.Остаток = 3;
	
	СтрокаВторогоУровня = СтрокаПервогоУровня.Строки.Добавить();
	СтрокаВторогоУровня.Номенклатура = "Босоножки женские";
	СтрокаВторогоУровня.ВНаличии = 2;
	СтрокаВторогоУровня.ВРезерве = 0;
	СтрокаВторогоУровня.Остаток = 2;
	
	СтрокаТретьегоУровня = СтрокаВторогоУровня.Строки.Добавить();
	СтрокаТретьегоУровня.Номенклатура = "Босоножки женские белые";
	СтрокаТретьегоУровня.ВНаличии = 1;
	СтрокаТретьегоУровня.ВРезерве = 0;
	СтрокаТретьегоУровня.Остаток = 1;
	
	СтрокаТретьегоУровня = СтрокаВторогоУровня.Строки.Добавить();
	СтрокаТретьегоУровня.Номенклатура = "Босоножки женские черные";
	СтрокаТретьегоУровня.ВНаличии = 1;
	СтрокаТретьегоУровня.ВРезерве = 0;
	СтрокаТретьегоУровня.Остаток = 1;
	
	СтрокаПервогоУровня = ДеревоТоваров.Строки.Добавить();
	СтрокаПервогоУровня.Склад = "Ларек ""Розница""";
	СтрокаПервогоУровня.ВНаличии = 171;
	СтрокаПервогоУровня.ВРезерве = 0;
	СтрокаПервогоУровня.Остаток = 171;
	
	СтрокаВторогоУровня = СтрокаПервогоУровня.Строки.Добавить();
	СтрокаВторогоУровня.Номенклатура = "Мука гречневая, 900 г.";
	СтрокаВторогоУровня.ВНаличии = 170;
	СтрокаВторогоУровня.ВРезерве = 0;
	СтрокаВторогоУровня.Остаток = 170;
	
	СтрокаВторогоУровня = СтрокаПервогоУровня.Строки.Добавить();
	СтрокаВторогоУровня.Номенклатура = "Кофеварка BRAUN KF22R";
	СтрокаВторогоУровня.ВНаличии = 1;
	СтрокаВторогоУровня.ВРезерве = 0;
	СтрокаВторогоУровня.Остаток = 1;
	
	СтрокаПервогоУровня = ДеревоТоваров.Строки.Добавить();
	СтрокаПервогоУровня.Склад = "Магазин ""Бытовая техника""";
	СтрокаПервогоУровня.ВНаличии = 159;
	СтрокаПервогоУровня.ВРезерве = 1;
	СтрокаПервогоУровня.Остаток = 160;
	
	СтрокаВторогоУровня = СтрокаПервогоУровня.Строки.Добавить();
	СтрокаВторогоУровня.Номенклатура = "Комбайн кухонный BINATONE FP 67";
	СтрокаВторогоУровня.ВНаличии = 9;
	СтрокаВторогоУровня.ВРезерве = 0;
	СтрокаВторогоУровня.Остаток = 9;
	
	СтрокаВторогоУровня = СтрокаПервогоУровня.Строки.Добавить();
	СтрокаВторогоУровня.Номенклатура = "Мясорубка MOULINEX A 15";
	СтрокаВторогоУровня.ВНаличии = 150;
	СтрокаВторогоУровня.ВРезерве = 1;
	СтрокаВторогоУровня.Остаток = 151;
	
	СтрокаВторогоУровня = СтрокаПервогоУровня.Строки.Добавить();
	СтрокаВторогоУровня.Номенклатура = "Вентилятор JIPONIC, напольный";
	СтрокаВторогоУровня.ВНаличии = 3;
	СтрокаВторогоУровня.ВРезерве = 1;
	СтрокаВторогоУровня.Остаток = 4;
	
КонецПроцедуры