&НаКлиенте
Процедура ВыполнитьКод(Команда)
	ВыполнитьКодНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКодНаСервере()
	
	//в этой процедуре напишите программный код, который решает задачу
	КаталогТоваров = Новый ТаблицаЗначений;
	
	КаталогТоваров.Колонки.Добавить("Категория");
	КаталогТоваров.Колонки.Добавить("Артикул");
	КаталогТоваров.Колонки.Добавить("Наименование");
	КаталогТоваров.Колонки.Добавить("Бренд");
	
	НоваяСтрока = КаталогТоваров.Добавить();
	НоваяСтрока.Категория = "Электротовары";
	НоваяСтрока.Артикул = "К-28758";
	НоваяСтрока.Наименование = "Комбайн кухонный BINATONE FP 67";
	НоваяСтрока.Бренд = "BINATONE";
	
	НоваяСтрока = КаталогТоваров.Добавить();
	НоваяСтрока.Категория = "Электротовары";
	НоваяСтрока.Артикул = "FG 151825";
	НоваяСтрока.Наименование = "Кофеварка Moulinex Subito Mini FG 151825";
	НоваяСтрока.Бренд = "Moulinex";
	
	НоваяСтрока = КаталогТоваров.Добавить();
	НоваяСтрока.Категория = "Холодильники";
	НоваяСтрока.Артикул = "SH-1234";
	НоваяСтрока.Наименование = "SH-1234 BOSH однокамерный, авторазморозка РОССИЯ";
	НоваяСтрока.Бренд = "BOSH";
	
	НоваяСтрока = КаталогТоваров.Добавить();
	НоваяСтрока.Категория = "Холодильники";
	НоваяСтрока.Артикул = "SH-255227";
	НоваяСтрока.Наименование = "SH255227 BOSH двухкамерный, авторазморозка РОССИЯ";
	НоваяСтрока.Бренд = "BINATONE";
	
	НоваяСтрока = КаталогТоваров.Добавить();
	НоваяСтрока.Категория = "Холодильники";
	НоваяСтрока.Артикул = "AM-234";
	НоваяСтрока.Наименование = "AM-234 ATLANT однокамерный, авторазморозка Беларусь";
	НоваяСтрока.Бренд = "ATLANT";
	
	НоваяСтрока = КаталогТоваров.Добавить();
	НоваяСтрока.Категория = "Холодильники";
	НоваяСтрока.Артикул = "AM-31432";
	НоваяСтрока.Наименование = "AM-3142 ATLANT двухкамерный, авторазморозка Беларусь";
	НоваяСтрока.Бренд = "ATLANT";
	
	НоваяСтрока = КаталогТоваров.Добавить();
	НоваяСтрока.Категория = "Холодильники";
	НоваяСтрока.Артикул = "S-545454";
	НоваяСтрока.Наименование = "S-545454 Samsung двухкамерный, авторазморозка РОССИЯ";
	НоваяСтрока.Бренд = "Samsung";
	
	НоваяСтрока = КаталогТоваров.Добавить();
	НоваяСтрока.Категория = "Холодильники";
	НоваяСтрока.Артикул = "S-87878";
	НоваяСтрока.Наименование = "S-87878 Samsung двухкамерный, авторазморозка РОССИЯ";
	НоваяСтрока.Бренд = "Samsung";
	
	НоваяСтрока = КаталогТоваров.Добавить();
	НоваяСтрока.Категория = "Холодильники";
	НоваяСтрока.Артикул = "S-3243234";
	НоваяСтрока.Наименование = "S-3243234 Samsung однокамрный, авторазморозка РОССИЯ";
	НоваяСтрока.Бренд = "Samsung";
	
	НоваяСтрока = КаталогТоваров.Добавить();
	НоваяСтрока.Категория = "Холодильники";
	НоваяСтрока.Артикул = "A-545411";
	НоваяСтрока.Наименование = "A-545411 ARISTON двухкамерный, авторазморозка Италия";
	НоваяСтрока.Бренд = "ARISTON";
	
	НоваяСтрока = КаталогТоваров.Добавить();
	НоваяСтрока.Категория = "Холодильники";
	НоваяСтрока.Артикул = "A-21212";
	НоваяСтрока.Наименование = "A-21212 ARISTON однокамерный, авторазморозка Италия";
	НоваяСтрока.Бренд = "ARISTON";
	
	НоваяСтрока = КаталогТоваров.Добавить();
	НоваяСтрока.Категория = "Холодильники";
	НоваяСтрока.Артикул = "EL-0909";
	НоваяСтрока.Наименование = "EL-0909 ELECTROLUX двухкамерный, авторазморозка Италия";
	НоваяСтрока.Бренд = "ELECTROLUX";
	
	НоваяСтрока = КаталогТоваров.Добавить();
	НоваяСтрока.Категория = "Холодильники";
	НоваяСтрока.Артикул = "EL-09010";
	НоваяСтрока.Наименование = "EL-09010 ELECTROLUX однокамерный, авторазморозка Италия";
	НоваяСтрока.Бренд = "ELECTROLUX";
	
	НоваяСтрока = КаталогТоваров.Добавить();
	НоваяСтрока.Категория = "Кондиционеры";
	НоваяСтрока.Артикул = "K-3465736";
	НоваяСтрока.Наименование = "Кондиционер ELEKTA";
	НоваяСтрока.Бренд = "ELEKTA";
	
	НоваяСтрока = КаталогТоваров.Добавить();
	НоваяСтрока.Категория = "Электротовары";
	НоваяСтрока.Артикул = "Э-543";
	НоваяСтрока.Наименование = "Пылесос ""Энергия-SANYO""";
	НоваяСтрока.Бренд = "SANYO";
	
	НоваяСтрока = КаталогТоваров.Добавить();
	НоваяСтрока.Категория = "Кондиционеры";
	НоваяСтрока.Артикул = "K-4635";
	НоваяСтрока.Наименование = "Кондиционер FIRMSTAR 12M";
	НоваяСтрока.Бренд = "FIRMSTAR";
	
	НоваяСтрока = КаталогТоваров.Добавить();
	НоваяСтрока.Категория = "Электротовары";
	НоваяСтрока.Артикул = "B-987";
	НоваяСтрока.Наименование = "Вентилятор JIPONIC, напольный";
	НоваяСтрока.Бренд = "JIPONIC";
	
	НоваяСтрока = КаталогТоваров.Добавить();
	НоваяСтрока.Категория = "Электротовары";
	НоваяСтрока.Артикул = "S-345";
	НоваяСтрока.Наименование = "Пылесос ""SAMSUNG""";
	НоваяСтрока.Бренд = "Samsung";
	
	НоваяСтрока = КаталогТоваров.Добавить();
	НоваяСтрока.Категория = "Кондиционеры";
	НоваяСтрока.Артикул = "БК-43673";
	НоваяСтрока.Наименование = "Кондиционер БК-2300";
	НоваяСтрока.Бренд = "Импортные";
	
	НоваяСтрока = КаталогТоваров.Добавить();
	НоваяСтрока.Категория = "Телевизоры";
	НоваяСтрока.Артикул = "T-73456";
	НоваяСтрока.Наименование = "SHARP, телевизор";
	НоваяСтрока.Бренд = "SHARP";
	
	НоваяСтрока = КаталогТоваров.Добавить();
	НоваяСтрока.Категория = "Телевизоры";
	НоваяСтрока.Артикул = "T-84";
	НоваяСтрока.Наименование = "LG, телевизор";
	НоваяСтрока.Бренд = "LG";
	
	НоваяСтрока = КаталогТоваров.Добавить();
	НоваяСтрока.Категория = "Телевизоры";
	НоваяСтрока.Артикул = "L-645";
	НоваяСтрока.Наименование = "JVC, телевизор";
	НоваяСтрока.Бренд = "JVC";
	
	НоваяСтрока = КаталогТоваров.Добавить();
	НоваяСтрока.Категория = "Телевизоры";
	НоваяСтрока.Артикул = "S-9345387";
	НоваяСтрока.Наименование = "SONY телевизор";
	НоваяСтрока.Бренд = "SONY";
	
	//1 Поиск товара по артикулу
	Кондиционер = КаталогТоваров.Найти("K-3465736", "Артикул");
	
	Если Кондиционер = Неопределено Тогда
		Сообщить("Товар по артикулу не найден");
	Иначе
		Сообщить(Кондиционер.Наименование);
	КонецЕсли;
	
	//2 Поиск холодильников SAMSUNG
	Отбор = Новый Структура();
	Отбор.Вставить("Бренд", "Samsung");
	
	МассивТоваровSamsung = КаталогТоваров.НайтиСтроки(Отбор); //Массив со всеми товарами бренда Samsung
	МассивХолодильниковSamsung = Новый Массив; //Массив для заполнения КОНКРЕТНО ХОЛОДИЛЬНИКАМИ Samsung
	
	Для каждого Товар из МассивТоваровSamsung Цикл
		
		Если Товар.Категория = "Холодильники" Тогда
			МассивХолодильниковSamsung.Добавить(Товар);
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивХолодильниковSamsung.Количество() > 0 Тогда
		
		Сообщить("Найдены следующие товары:");
		
		Для каждого Холодильник из МассивХолодильниковSamsung Цикл
			Сообщить(Холодильник.Наименование + " арт." + Холодильник.Артикул);
		КонецЦикла;
		
	Иначе
		Сообщить("Холодильников Samsung не нвйдено");
	КонецЕсли;
	
	//3 Количество товаров определенной категории
	МассивТелевизоров = Новый Массив;
	
	Для каждого Строка из КаталогТоваров Цикл
		Если Строка.Категория = "Телевизоры" Тогда
			МассивТелевизоров.Добавить(Строка);
		КонецЕсли;
	КонецЦикла;
	
	КоличествоТелевизоров = МассивТелевизоров.Количество();
	
	Сообщить("Количество товаров в категории ""Телевизоры"": " + КоличествоТелевизоров);
	
	//4 Удаление товаров определенной категории
	МассивКУдалению = Новый Массив;
	
	Для каждого Строка из КаталогТоваров Цикл
		
		Если Строка.Категория = "Электротовары" Тогда
			МассивКУдалению.Добавить(Строка);
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого ЭлементКУдалению из МассивКУдалению Цикл
		//КаталогТоваров.Удалить(ЭлементКУдалению); //Закомментировал, т.к. в 5м задании понадобятся товары из категории "Электротовары"
	КонецЦикла;
	
	//5 Ассортимент по категориям
	КЧ = Новый КвалификаторыЧисла(12,0);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Число"));
	ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);
	
	КаталогТоваров.Колонки.Добавить("КолонкаДляСуммирования", ОписаниеТиповЧ, "КолонкаДляСуммирования");
	
	Для каждого Строка из КаталогТоваров Цикл
		Строка.КолонкаДляСуммирования = 1;
	КонецЦикла;
	
	КаталогТоваров.Свернуть("Категория", "КолонкаДляСуммирования");
	
	Для каждого Строка из КаталогТоваров Цикл
		Сообщить(Строка.Категория + ": " + Строка.КолонкаДляСуммирования);
	КонецЦикла;
	
КонецПроцедуры