#Область Задача1

&НаКлиенте
Процедура СоздатьДокумент(Команда)
	СоздатьДокументНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументНаСервере()
	
	//Создаем новый документ
	НовДок = Документы.ЗаказКлиента.СоздатьДокумент();
	
	//Заполняем реквизиты
	Организация = Справочники.Организации.ОсновнаяОрганизация;
	Склад = Справочники.Склады.Основной;
	Контрагент = Справочники.Контрагенты.НайтиПоНаименованию("Агроимпульс ТД ООО");
	Договор = Справочники.ДоговорыКонтрагентов.НайтиПоКоду("00011");
	
	НовДок.Организация = Организация;
	НовДок.Склад = Склад;
	НовДок.Контрагент = Контрагент;
	НовДок.Договор = Договор;
	НовДок.Дата = ТекущаяДата();
	
	//Создаем и заполняем табличную часть
	ТабЧасть = НовДок.Товары;
	СтрокаТабЧасти = ТабЧасть.Добавить();
	
	НоменклатураХолодильник = Справочники.Номенклатура.НайтиПоНаименованию("Холодильник ATLANT ХМ 4208-000");
	СписокИменРеквизитов = "ЕдиницаИзмерения,СтавкаНДС";
	Результат = ОбщегоНазначенияВызовСервера.ПолучитьРеквизитыНоменклатуры(НоменклатураХолодильник, СписокИменРеквизитов);
	
	СтрокаТабЧасти.Номенклатура = НоменклатураХолодильник;
	СтрокаТабЧасти.ЕдиницаИзмерения = Результат.ЕдиницаИзмерения;
	СтрокаТабЧасти.СтавкаНДС = Результат.СтавкаНДС;
	СтрокаТабЧасти.Количество = 7;
	СтрокаТабЧасти.Цена = 178900;
	
	ОбработкаТабличнхЧастейСервер.РассчитатьСуммыВСтрокеТабличнойЧасти(СтрокаТабЧасти);
	
	НовДок.Записать();
	
	//1. Создать документ "Заказ клиента", заполнить реквизиты следующими значениями:
	//Организация:  "Электроник ООО"
	//Склад:		"Основной" 
	//Контрагент:	"Агроимпульс ТД ООО"
	//Договор:		"Договор № б/н от 12.10.2021"
	//***Табличная часть "Товары"***
	//Номенклатура: "Холодильник ATLANT ХМ 4208-000"
	
	//Количество: 7 шт.
	//Цена: 17900 руб.
	//***
	//Единицу измерения, ставку ндс заполнить значениями из номенклатуры
	//Суммы в строке должны быть рассчитаны по аналогии с тем, как описано в модуле формы документа
	
КонецПроцедуры

#КонецОбласти

#Область Задача2

&НаКлиенте
Процедура НайтиДокумент(Команда)
	НайтиДокументНаСервере();
КонецПроцедуры

&НаСервере
Процедура НайтиДокументНаСервере()
	
	//2. Найти документ "Заказ клиента" с номером "00000000003" (в этом году)
	ДокументЗаказКлиента = Документы.ЗаказКлиента.НайтиПоНомеру("00000000003", '20210101');
	Сообщить("Заказ клиента " + ДокументЗаказКлиента.Контрагент + " найден");
КонецПроцедуры

#КонецОбласти

#Область Задача3

&НаКлиенте
Процедура ИзменитьДокумент(Команда)
	ИзменитьДокументНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИзменитьДокументНаСервере()
	
	//3. Изменить документ "Заказ клиента" с номером "00000000005" (в этом году):
	//Увеличить цены во всех строках табличной части "Товары" на 10% и пересчитать суммы
	ДокументСсылка = Документы.ЗаказКлиента.НайтиПоНомеру("00000000005", '20210101');
	ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
	ТабЧасть = ДокументОбъект.Товары;
	
	Для каждого Строка из ТабЧасть Цикл
		Строка.Цена = Строка.Цена * 1.1;
		ОбработкаТабличнхЧастейСервер.РассчитатьСуммыВСтрокеТабличнойЧасти(Строка);
	КонецЦикла;
	
	ДокументОбъект.Записать();
	Сообщить("Документ успешно изменен");
	
КонецПроцедуры

#КонецОбласти

#Область Задача4

&НаКлиенте
Процедура ЗаполнитьНаОсновании(Команда)
	ЗаполнитьНаОснованииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаОснованииНаСервере()
	
	//4. На основании документа "Заказ клиента" с номером "00000000005" создать документ "Расходная накладная"
	НовДок = Документы.РасходнаяНакладная.СоздатьДокумент();
	
	ДокументСсылкаЗаказКлиента = Документы.ЗаказКлиента.НайтиПоНомеру("00000000005", '20210101');
	
	НовДок.Заполнить(ДокументСсылкаЗаказКлиента);
	НовДок.Дата = ТекущаяДата();
	НовДок.Записать();
КонецПроцедуры

#КонецОбласти

#Область Задача5

&НаКлиенте
Процедура ВыбратьДокументы(Команда)
	ВыбратьДокументыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыбратьДокументыНаСервере()
	
	//5. Выбрать все документы "Заказ клиента" за ноябрь 2021 года по контрагенту "ООО "Рога и Копыта"" 
	//и вывести в виде сообщений номера и суммы документов
	//Пример: 
	//"Заказ № 000001 на сумму 20000 рублей"
	//"Заказ № 000003 на сумму 67500 рублей"
	
	РогаИКопыта = Справочники.Контрагенты.НайтиПоНаименованию("ООО ""Рога и копыта""");
	
	////Первый способ
	//Выборка = Документы.ЗаказКлиента.Выбрать('20211101', '20211130');
	//Пока Выборка.Следующий() Цикл
	//	Если Выборка.Контрагент = РогаИКопыта Тогда
	//		Сообщить("Заказ " + Выборка.Номер + " на сумму " + Выборка.СуммаДокумента + " рублей");
	//	КонецЕсли;	
	//КонецЦикла;
	
	//Второй способ (!!! Нужно включить ИНДЕКСИРОВАНИЕ у реквизита Контрагент документа ЗаказКлиента !!!)
	Отбор = Новый Структура;
	Отбор.Вставить("Контрагент", РогаИКопыта);
	Выборка = Документы.ЗаказКлиента.Выбрать('20211101', '20211130', Отбор);
	Пока Выборка.Следующий() Цикл
		Сообщить("Заказ " + Выборка.Номер + " на сумму " + Выборка.СуммаДокумента + " рублей");
	КонецЦикла;
	
	
КонецПроцедуры

#КонецОбласти

#Область Задача6

&НаКлиенте
Процедура ПровестиДокумент(Команда)
	ПровестиДокументНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПровестиДокументНаСервере()
	
	//6. Провести все документы "Заказ клиента" за ноябрь 2021 года
	ЗаказКлиентаВыборка = Документы.ЗаказКлиента.Выбрать('20211101', '20211130');
	
	Пока ЗаказКлиентаВыборка.Следующий() Цикл
		ЗаказКлиентаСсылка = ЗаказКлиентаВыборка.Ссылка;
		ЗаказКлиентаОбъект = ЗаказКлиентаСсылка.ПолучитьОбъект();
		ЗаказКлиентаОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Задача7

&НаКлиенте
Процедура ОтменитьПроведение(Команда)
	ОтменитьПроведениеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтменитьПроведениеНаСервере()
	
	//7. Отменить проведение документа "Заказ клиента" с номером "00000000005"
	СсылкаЗаказКлиента = Документы.ЗаказКлиента.НайтиПоНомеру("00000000005", '20210101');
	ОбъектЗаказКлиента = СсылкаЗаказКлиента.ПолучитьОбъект();
	ОбъектЗаказКлиента.Записать(РежимЗаписиДокумента.ОтменаПроведения);
КонецПроцедуры

#КонецОбласти

# Область Задача8

&НаКлиенте
Процедура ОтменитьПроведениеВсех(Команда)
	ОтменитьПроведениеВсехНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтменитьПроведениеВсехНаСервере()
	
	//8. Отменить проведение всех документов ЗаказКлиента
	ЗаказКлиентаВыборка = Документы.ЗаказКлиента.Выбрать();
	
	Пока ЗаказКлиентаВыборка.Следующий() Цикл
		ЗаказКлиентаОбъект = ЗаказКлиентаВыборка.ПолучитьОбъект();
		ЗаказКлиентаОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти
